{
    "playlist_id": "PLp4G6oBUcv8w8ujRtP5BtvJe8PXBwiTdl",
    "category": "tier_list",
    "video_id": "SgyUoY0IZ7A",
    "title": "The Best And Worst Shoulder Exercises",
    "published_date": "2024-09-10T13:31:57Z",
    "video_url": "https://www.youtube.com/watch?v=SgyUoY0IZ7A",
    "thumbnail_img": "https://i.ytimg.com/vi/SgyUoY0IZ7A/default.jpg",
    "exercises_summary": {
        "exercise_rankings": {
            "S-Tier": [
                {
                    "exercise_name": "Cable Lateral Raise",
                    "setup_notes": "Set the cable at approximately hand height.",
                    "execution_notes": "Ensure your arm and the cable form a 90-degree angle to achieve the highest tension. For better connection with the side delts, use wrist cuffs (and optionally hold a lacrosse ball) as standard D-handles can cause forearm pump, diverting focus.",
                    "tier_reasons": "Provides maximum tension on the side delt when it's most stretched. Feels excellent with nice, even tension throughout the range of motion. Easy to connect with the side delts. Meets all criteria for hypertrophy.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid, as it is primarily responsible for lifting the arm out to the side.",
                    "limitations": "none",
                    "alternative_options": "Can be performed with a standard D-handle or with wrist cuffs.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff's favorite side delt exercise. Crowned as the best of the best for overall shoulder development.",
                    "number_one_for": "Side Delts"
                },
                {
                    "exercise_name": "Cable Y-Raise",
                    "setup_notes": "none",
                    "execution_notes": "Sweep the cable up and out and back.",
                    "tier_reasons": "Provides an even bigger range of motion compared to standard cable lateral raises.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "Some people may find them a little more awkward to learn.",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "Behind-the-Back Cuffed Lateral Raise",
                    "setup_notes": "Hook your wrists into cuffs (optionally grab a pair of lacrosse balls). Step over one of the cables, spin around, and cross the cables over behind your back.",
                    "execution_notes": "Step forward and raise the cables out and slightly forward.",
                    "tier_reasons": "Main advantage is the ability to work both arms simultaneously, making it twice as time-efficient.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "Gimmicky looking.",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff states, 'Who cares what it looks like if it works, it works.'",
                    "number_one_for": "none"
                },
                {
                    "exercise_name": "Reverse Pec Deck (Sideways)",
                    "setup_notes": "Sit sideways on the machine.",
                    "execution_notes": "none",
                    "tier_reasons": "Provides consistent tension throughout the range of motion. Bracing the chest directs all tension from the weight stack into the rear delts. Sitting sideways allows for a much deeper stretch.",
                    "target_muscles": [
                        "Rear Delts"
                    ],
                    "target_muscle_parts": "Posterior head of the deltoid.",
                    "limitations": "Requires performing one arm at a time, which increases workout duration.",
                    "alternative_options": "Can superset each arm (one side works while the other rests) to manage time.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff's instinct was A-Tier, but the sideways position elevates it to S-Tier.",
                    "number_one_for": "none"
                },
                {
                    "exercise_name": "Reverse Cable Crossover",
                    "setup_notes": "Hold the cables themselves, not the handles.",
                    "execution_notes": "Cross your arms over at the top for an amazing stretch. Focus on sweeping the cables out rather than yanking them back. Alternate which arm crosses over on top from set to set to prevent left-to-right muscle imbalances.",
                    "tier_reasons": "Provides an amazing stretch on the rear delts. Offers an enormous range of motion with nice, even tension throughout. Feels smooth without clanging. Creates a massive connection with the rear delts.",
                    "target_muscles": [
                        "Rear Delts"
                    ],
                    "target_muscle_parts": "Posterior head of the deltoid.",
                    "limitations": "none",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff's number one rear delt builder.",
                    "number_one_for": "Rear Delts"
                }
            ],
            "A-Tier+": [
                {
                    "exercise_name": "Machine Shoulder Press",
                    "setup_notes": "Find a good machine that allows your delts to get into a deep stretch.",
                    "execution_notes": "none",
                    "tier_reasons": "Feels better than dumbbells. Less dependent on technique and coordination, allowing the delts to be taken to failure without losing control of the weight. Good for overload.",
                    "target_muscles": [
                        "Anterior Delts"
                    ],
                    "target_muscle_parts": "Primarily the anterior (front) head of the deltoid.",
                    "limitations": "Still very front delt dominant. Requires access to a good machine.",
                    "alternative_options": "If a good shoulder press machine is unavailable, the seated dumbbell shoulder press is the next best option.",
                    "scientific_insights": "none",
                    "additional_notes": "A personal favorite and Jeff's usual go-to vertical pressing option for hypertrophy. Number one exercise for the front delts.",
                    "number_one_for": "Front Delts"
                },
                {
                    "exercise_name": "Atlantis Standing Machine Lateral Raise",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "Feels very smooth, providing even and consistent tension on the side delts throughout the range of motion. Easy to progressively overload by adding weight or reps week to week. Excellent for overload and feel.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "Cannot move arms across the body, resulting in a slightly less deep stretch compared to cables or the Arnold-style lying raise.",
                    "alternative_options": "Compared to cables and the Arnold-style lying raise, it offers less stretch.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff uses this exercise every week and is close to maxing out the weight stack. Very close to S-Tier.",
                    "number_one_for": "none"
                }
            ],
            "A-Tier": [
                {
                    "exercise_name": "Lean-in Dumbbell Lateral Raise",
                    "setup_notes": "Lean against a stable object like a bench or a rack.",
                    "execution_notes": "Perform lateral raises while maintaining the lean.",
                    "tier_reasons": "Modifies the resistance curve to place more tension on the side delt when it is most stretched. Considered the most effective way to perform lateral raises with dumbbells.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "none",
                    "alternative_options": "More effective than the standard standing dumbbell lateral raise due to the modified resistance curve.",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "Dumbbell Overhead Press (Seated)",
                    "setup_notes": "none",
                    "execution_notes": "Allow the dumbbells to converge at the top of the movement.",
                    "tier_reasons": "Allows for faster setup compared to barbells. Provides a greater range of motion at both the bottom and the top. Potentially offers more side delt involvement.",
                    "target_muscles": [
                        "Anterior Delts",
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Primarily the anterior (front) head of the deltoid, with additional involvement from the lateral (side) head as it activates to stabilize the dumbbells and prevent them from falling forward or backward.",
                    "limitations": "none",
                    "alternative_options": "Compared to barbell overhead press, it's faster, offers more range of motion, and potentially more side delt activation.",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "Arnold-style Side Lying Dumbbell Raise",
                    "setup_notes": "Lock your body in against a bench.",
                    "execution_notes": "none",
                    "tier_reasons": "Provides high tension on the delts while they are in a stretched position. Offers excellent stability due to being braced against a bench. Achieves a huge range of motion and should result in a great side delt pump.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "The exercise may appear somewhat unusual.",
                    "alternative_options": "Unlike a standing dumbbell lateral raise, this variation provides high tension in the stretched position.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff notes he picked this up from Arnold's Instagram and really likes it.",
                    "number_one_for": "none"
                },
                {
                    "exercise_name": "Rope Face Pull",
                    "setup_notes": "Set the rope attachment a little lower on the cable machine.",
                    "execution_notes": "Use an underhand grip and externally rotate your shoulders as you pull, mimicking a rear double biceps pose.",
                    "tier_reasons": "Effectively targets the rear delts. Provides a significant stretch on the rear delt. Feels good and is solid for progressive overload.",
                    "target_muscles": [
                        "Rear Delts",
                        "Mid Traps"
                    ],
                    "target_muscle_parts": "Primarily the posterior (rear) head of the deltoid. However, the mid traps are also highly active and difficult to disengage, which means the rear delts might not always be the limiting factor.",
                    "limitations": "It is challenging to prevent the mid traps from taking over, which can reduce the specific isolation on the rear delts.",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "Considered a great exercise to include.",
                    "number_one_for": "none"
                }
            ],
            "B-Tier+": [
                {
                    "exercise_name": "Barbell Overhead Press (Standing)",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "Provides high tension on the shoulders in the stretched position. Extremely effective for progressive overload, allowing for consistent increases in weight, reps, or technique refinement. A very gratifying lift once technique is mastered. Jeff believes it is overhated by the science community and overrated by powerlifting purists.",
                    "target_muscles": [
                        "Anterior Delts",
                        "Side Delts",
                        "Rear Delts",
                        "Lower Body",
                        "Core"
                    ],
                    "target_muscle_parts": "Primarily the anterior (front) head of the deltoid, with less activation of the lateral (side) and posterior (rear) heads. The lower body and core are engaged to maintain balance, which can shift some tension away from the shoulders.",
                    "limitations": "Very anterior delt dominant. Not the most stable exercise due to the standing position, requiring significant lower body and core involvement for balance.",
                    "alternative_options": "Compared to seated OHP, it lacks stability but is more satisfying. Compared to dumbbell OHP, it's slower, offers less ROM, and less side delt involvement.",
                    "scientific_insights": "Activation patterns show a dominance of the anterior deltoid.",
                    "additional_notes": "Considered one of the most impressive feats of strength in the gym.",
                    "number_one_for": "none"
                }
            ],
            "B-Tier": [
                {
                    "exercise_name": "Standing Dumbbell Lateral Raise",
                    "setup_notes": "Grab a pair of dumbbells.",
                    "execution_notes": "Lift your arms out to the side.",
                    "tier_reasons": "Super simple and quick to perform, making it time-efficient. Despite limitations, it effectively grows shoulders, as evidenced by bodybuilders. However, it provides zero tension on the side delts at the bottom (most stretched position) and only reaches peak tension when the arms are at 90 degrees (most shortened position).",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid, which is responsible for abducting the arm.",
                    "limitations": "Zero tension at the bottom (stretched position), with peak tension only at the top (shortened position).",
                    "alternative_options": "Less effective than cable lateral raises.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff still performs these when time-constrained. He slightly favors side delt exercises because front delts are often overdeveloped from chest work.",
                    "number_one_for": "none"
                },
                {
                    "exercise_name": "Lean-away Dumbbell Lateral Raise",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "May shift some emphasis away from the rotator cuff muscles and onto the lateral deltoid, depending on the interpretation of a specific study. However, it still suffers from the issue of not placing high enough tension on the deltoid in the stretched position.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "Does not place high enough tension in the stretched position.",
                    "alternative_options": "none",
                    "scientific_insights": "A study is referenced, but its name and detailed findings are not provided.",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "Super ROM Lateral Raise",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "Allows for a full contraction of the side delt. While current evidence suggests stretch is more important than squeeze, there's limited direct evidence for shoulders, making this worth trying.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "Suffers from the same resistance curve issues as standard dumbbell lateral raises, meaning insufficient tension in the stretched position.",
                    "alternative_options": "none",
                    "scientific_insights": "The trend of current evidence suggests the stretched position is more important than the squeezed position for hypertrophy, but there is very little direct evidence specifically for shoulder training.",
                    "additional_notes": "Jeff learned this exercise from Dr. Mike Israetel and found it effectively activated his delts.",
                    "number_one_for": "none"
                },
                {
                    "exercise_name": "Barbell Overhead Press (Seated)",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "Addresses the stability issue present in the standing overhead press by eliminating the need for lower body and core balance.",
                    "target_muscles": [
                        "Anterior Delts"
                    ],
                    "target_muscle_parts": "Primarily the anterior (front) head of the deltoid.",
                    "limitations": "Remains very front delt dominant. Jeff finds it less satisfying than the standing overhead press.",
                    "alternative_options": "Fixes the stability issue of the standing overhead press.",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "Seated Machine Lateral Raise",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "Similar benefits to the standing machine lateral raise.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "The pads being higher on the arms can feel less comfortable. The short moment arm to the shoulder may necessitate heavier loads, potentially causing discomfort in the shoulders.",
                    "alternative_options": "Similar to the Atlantis Standing Machine Lateral Raise.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff still likes these, but places them in B-Tier due to being picky, despite being between A-Tier and B-Tier.",
                    "number_one_for": "none"
                },
                {
                    "exercise_name": "Upright Row (Cable with Rope)",
                    "setup_notes": "Use a cable machine with a rope attachment.",
                    "execution_notes": "Sweep the handles out to the sides as you perform the row.",
                    "tier_reasons": "Effectively targets both the upper traps and the side delts, with some biceps involvement. There is no evidence that they contribute to shoulder issues in individuals with healthy shoulders. Considered a great overall 'yolk' builder.",
                    "target_muscles": [
                        "Upper Traps",
                        "Side Delts",
                        "Biceps"
                    ],
                    "target_muscle_parts": "Upper trapezius and the lateral head of the deltoid, with some involvement of the biceps brachii.",
                    "limitations": "Even with cables, the upper traps tend to take over, making it difficult to achieve true exhaustion of the delt fibers.",
                    "alternative_options": "none",
                    "scientific_insights": "There is no evidence that upright rows contribute to shoulder issues, provided the individual has healthy shoulders.",
                    "additional_notes": "Jeff considers this an overhated exercise and is a fan.",
                    "number_one_for": "none"
                },
                {
                    "exercise_name": "Bent-Over Reverse Dumbbell Flies",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "A good option if access to cables is limited or when time-constrained. Jeff notes his rear delts consistently get very sore from this exercise.",
                    "target_muscles": [
                        "Rear Delts"
                    ],
                    "target_muscle_parts": "Posterior head of the deltoid.",
                    "limitations": "Provides zero tension at the bottom of the movement, when the delts are in their most stretched position.",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff still performs these when in a hurry. Would likely be in A-Tier if it provided sufficient tension in the stretched position.",
                    "number_one_for": "none"
                }
            ],
            "C-Tier": [
                {
                    "exercise_name": "Banded Lateral Raise",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "Provides zero tension in the stretched position and maximum tension only at the top of the movement.",
                    "target_muscles": [
                        "Side Delts"
                    ],
                    "target_muscle_parts": "Lateral head of the deltoid.",
                    "limitations": "Zero tension in the stretched position, maximum tension at the top.",
                    "alternative_options": "Dumbbells, cables, or machine lateral raises are generally better choices unless bands are the only equipment available.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff's least favorite lateral raise option and rarely included in his programming.",
                    "number_one_for": "none"
                }
            ],
            "D-Tier": [
                {
                    "exercise_name": "Front Raises (Dumbbell, Cable, Machine)",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "Considered redundant in most training programs because the front delts typically receive more than enough stimulation from any pressing movements. Jeff identifies it as the 'worst of the worst' overall shoulder exercise, not due to its ineffectiveness for muscle growth, but because of its redundancy.",
                    "target_muscles": [
                        "Anterior Delts"
                    ],
                    "target_muscle_parts": "Front head of the deltoid.",
                    "limitations": "Redundant for most individuals.",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "Can be a suitable option for individuals with underdeveloped anterior delts or those who cannot perform pressing exercises for various reasons.",
                    "number_one_for": "none"
                }
            ]
        }
    },
    "main_knowledge_summary": {
        "muscle_group": [
            "Anterior Deltoid (Front Delt)",
            "Lateral Deltoid (Side Delt)",
            "Posterior Deltoid (Rear Delt)",
            "Upper Traps",
            "Mid Traps",
            "Biceps",
            "Rotator Cuff",
            "Lower Body (stabilizers)",
            "Core (stabilizers)"
        ],
        "criterias": [
            {
                "High Tension in Stretched Position": "The exercise provides significant tension to the target muscle when it is in its most lengthened state."
            },
            {
                "Feels Good": "The exercise does not cause shoulder pain and has a smooth, consistent resistance profile throughout the movement."
            },
            {
                "Simple Progression": "It is easy to progressively overload the exercise by adding weight or reps over time, or by improving technique."
            }
        ],
        "muscle_part_anatomy_function": [
            {
                "Anterior (Front) Deltoid": "Raises the arm up to the front. Often overdeveloped relative to side and rear heads due to involvement in chest pressing movements."
            },
            {
                "Lateral (Side) Deltoid": "Lifts the arm out to the side. Crucial for developing an 'x-frame' physique with a tapered look."
            },
            {
                "Posterior (Rear) Deltoid": "Pulls the arm back."
            },
            {
                "Deltoids (General)": "The three heads can be thought of as almost separate muscles, requiring specific targeting."
            }
        ],
        "form_details": "For **Lean-in Dumbbell Lateral Raises**, lean against a bench or rack to modify the resistance curve. For **Seated Dumbbell Shoulder Press**, allow dumbbells to converge at the top for increased range of motion. For **Arnold-style Side-Lying Dumbbell Raise**, lie sideways against a bench for stability and a deep stretch. For **Cable Lateral Raises**, set the cable at approximately hand height to ensure maximum tension when the arm and cable form a 90-degree angle; using wrist cuffs (and optionally a lacrosse ball) can improve connection by reducing forearm pump and grip as a limiting factor. For **Cable Y Raises**, sweep the cable up and out and back. For **Behind-the-Back Cuffed Lateral Raises**, hook wrists into cuffs, optionally grab lacrosse balls, step over one cable, spin around and cross cables behind your back, then step forward and raise cables out and slightly forward. For **Upright Rows**, use cables with a rope and sweep the handles out as you row. For **Reverse Pec Deck**, sit sideways to achieve a much deeper stretch, though this requires working one arm at a time. For **Rope Face Pulls**, set the rope a little lower, use an underhand grip, and externally rotate your shoulders as you pull (mimicking a rear double biceps pose). For **Reverse Cable Crossovers**, hold the cables themselves (not the handles) for a smoother movement and to avoid clanging, cross your arms over at the top for an amazing stretch, and alternate which arm crosses over on top from set to set to avoid muscle imbalances; focus on sweeping the cables out rather than yanking them back.",
        "training_keys": "Prioritize exercises that target the **side delts** over front delts, as front delts are often sufficiently stimulated by chest pressing movements and tend to be overdeveloped. For optimal **side delt** growth, favor exercises that provide high tension in the stretched position, such as the Lean-in Dumbbell Lateral Raise, Arnold-style Side-Lying Dumbbell Raise, and especially Cable Lateral Raises. For **front delts**, while pressing movements are effective, the Machine Shoulder Press is highlighted for its deep stretch, consistent feel, and ability to push to failure without coordination issues. Front raises are generally considered redundant unless front delts are specifically underdeveloped or presses cannot be performed. For **rear delts**, focus on movements that offer consistent tension throughout the range of motion and a deep stretch, like the Reverse Pec Deck (especially when sitting sideways) and Reverse Cable Crossovers. The Rope Face Pull is also effective for rear delts, providing a good stretch and overload, though mid traps may also be significantly involved. When performing exercises, ensure a smooth resistance profile and avoid movements that cause shoulder pain. For exercises like the Overhead Press, while impressive for strength, be aware of its anterior delt dominance and the stability demands of the standing variation, which can shift tension away from the shoulders. Machine-based exercises can be beneficial for hypertrophy due to reduced technique dependence, allowing for full muscle failure.",
        "research_insights": "The video mentions that the current trend of evidence suggests the **stretch position is more important than the squeeze** for muscle growth, though it notes there is 'very little direct evidence on the shoulders about this' specifically. It also references a study (without explicit citation) regarding **lean-away dumbbell lateral raises** that 'might shift some emphasis away from the muscles of the rotator cuff and onto the lateral delt depending on how you interpret this study.' For **Upright Rows**, it states there is 'no evidence that they contribute to shoulder issues' as long as the individual has healthy shoulders. The effectiveness of **dumbbell lateral raises** for building large side delts is supported by 'real-world examples of bodybuilders.'",
        "optimization_notes": "To optimize **dumbbell lateral raises**, lean against a bench or rack to increase tension in the stretched position, making them more effective. For **machine shoulder presses**, seek out machines that allow for a deep delt stretch. For **reverse pec deck**, sitting sideways can provide a much deeper stretch for the rear delts, though it requires single-arm work; supersetting each arm can maintain efficiency. For **cable lateral raises**, using wrist cuffs can enhance the mind-muscle connection by removing grip and forearm fatigue as limiting factors. For **behind-the-back cuffed lateral raises**, this variation allows for training both arms simultaneously, doubling time efficiency. For **reverse cable crossovers**, hold the cables directly instead of the handles to ensure a smoother movement and prevent clanging, and alternate which arm crosses over to prevent imbalances. Always prioritize exercises that allow for simple progression (adding weight or reps) over time to ensure continuous muscle growth."
    }
}