{
    "playlist_id": "PLp4G6oBUcv8w8ujRtP5BtvJe8PXBwiTdl",
    "category": "tier_list",
    "video_id": "OpRMRhr0Ycc",
    "title": "The Best & Worst TRICEPS Exercises (Ranked Using Science)",
    "published_date": "2024-07-15T12:18:52Z",
    "video_url": "https://www.youtube.com/watch?v=OpRMRhr0Ycc",
    "thumbnail_img": "https://i.ytimg.com/vi/OpRMRhr0Ycc/default.jpg",
    "exercises_summary": {
        "exercise_rankings": {
            "S-Tier": [
                {
                    "exercise_name": "Overhead Cable Triceps Extension",
                    "setup_notes": "Arms up overhead.",
                    "execution_notes": "Bend and extend your elbow with your arms positioned overhead.",
                    "tier_reasons": "This exercise provides super high tension in the stretched position, which is crucial for muscle growth. The long head of the triceps, being the only head that crosses both the elbow and shoulder joints, is put under a much bigger stretch when the arm is up overhead. The cable also provides high tension in this stretched position. It is considered a superior exercise for muscle growth.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "All three heads, with particular emphasis on the long head. The long head is more stretched when the arm is up overhead, which is important for its development.",
                    "limitations": "none",
                    "alternative_options": "Compared to press downs, this exercise caused about 40% more triceps growth.",
                    "scientific_insights": "A 2023 study found that overhead extensions caused about 40% more triceps growth than press downs, indicating that getting the long head into a more lengthened position is important for muscle growth.",
                    "additional_notes": "This is crowned as the best of the best triceps exercise. It will grow all three heads very effectively and has been validated as a superior exercise in long-term hypertrophy studies."
                },
                {
                    "exercise_name": "Skull Crushers (Barbell/Easy Bar)",
                    "setup_notes": "none",
                    "execution_notes": "Arc the bar back behind your head instead of literally stopping at your skull. To ensure immediate tension, start the range of motion with your elbows slightly back rather than straight up, then arc the weight back.",
                    "tier_reasons": "This exercise offers super high tension while the triceps are most stretched, especially when arcing the bar back behind the head. It feels good, particularly if an easy bar is used to ease wrist strain. It is a great movement for progressive overload, allowing easy addition of weight or reps week to week. The non-uniform tension can be mitigated by starting the range of motion with elbows slightly back.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "All three heads, with particular emphasis on the long head due to the deep stretch achieved.",
                    "limitations": "Some people may find them a little less smooth than cables.",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "This is Jeff's favorite free weight triceps exercise, and he performs it frequently."
                }
            ],
            "A-Tier": [
                {
                    "exercise_name": "Press Down (Bar)",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "The movement feels stable, which directs more tension to the triceps. The cable provides more or less even tension on the triceps throughout the range of motion. The bar helps you feel more locked in. It allows for easy progressive overload by adding weight or reps. It is very close to S-tier but doesn't get the triceps into a big stretch at the top.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "All three heads, but probably grows the medial and lateral heads a little better than the long head.",
                    "limitations": "Never gets the triceps into a big stretch at the top.",
                    "alternative_options": "Compared to the rope press down, the bar attachment is more rigid and stable, directing more tension to the triceps and allowing for more overload.",
                    "scientific_insights": "none",
                    "additional_notes": "This is an exercise that Jeff strongly recommends and does pretty much every single week."
                },
                {
                    "exercise_name": "Overhead Cable Triceps Extension (Rope)",
                    "setup_notes": "Arms up overhead.",
                    "execution_notes": "none",
                    "tier_reasons": "This variation still provides all the benefits of training the long head in a more lengthened position, which is crucial for muscle growth. However, the rope attachment will limit the ability to overload the triceps to some extent.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "All three heads, with particular emphasis on the long head due to the lengthened position.",
                    "limitations": "The rope attachment will limit the ability to overload the triceps to some extent.",
                    "alternative_options": "Compared to the bar version, the rope limits overload potential.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff usually prefers the bar, but notes that the difference may not be huge over the long term as long as effort is high and progress is tracked."
                },
                {
                    "exercise_name": "Katana Triceps Extension",
                    "setup_notes": "To set up, grab each side's cable with the same hand and then spin around 180° while crossing your arms over, or start with the cables crossed in front of you and then duck underneath and step through. Start with the cables at around or just above waist height. Your arms should end up in a position about 30 to 40° forward relative to being flared out to the sides, known as the scapular plane.",
                    "execution_notes": "Cross your arms overhead and grab the opposite side's cable.",
                    "tier_reasons": "The scapular plane position feels very comfortable for many people. This exercise offers the rare benefit of hitting both arms individually while saving time by working both sides at once. It was considered for S-tier but was dropped to A-tier due to requiring more setup and having a bit of a learning curve.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "none",
                    "limitations": "Requires more setup and can have a bit of a learning curve.",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "This is a personal favorite of Jeff and can be great for addressing any left-right imbalances."
                },
                {
                    "exercise_name": "One-Arm Dumbbell Triceps Extension",
                    "setup_notes": "none",
                    "execution_notes": "Perform with one arm at a time.",
                    "tier_reasons": "This variation allows you to find a good angle to point your elbows in that feels more comfortable on your shoulders. Because you're doing one arm at a time, the dumbbell will be less bulky and awkward compared to a two-arm dumbbell French press. It still gets the long head stretched. However, it doesn't offer the same smooth tension as cables.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Long head (stretched).",
                    "limitations": "Does not offer the same smooth tension as cables.",
                    "alternative_options": "This variation solves some of the issues of the two-arm dumbbell French press, such as awkwardness and potential wrist strain.",
                    "scientific_insights": "none",
                    "additional_notes": "This is a really good option, especially if you only have access to dumbbells."
                },
                {
                    "exercise_name": "Dumbbell Skull Crushers",
                    "setup_notes": "none",
                    "execution_notes": "The execution is the same as barbell skull crushers, but using dumbbells.",
                    "tier_reasons": "On paper, this exercise should be S-tier as it offers high tension in the stretched position and allows for individual arm training. However, in practice, Jeff finds them a little more awkward to control than an easy bar or straight bar skull crusher, possibly because the dumbbells are free-moving in that lying overhead position.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "All three heads, with emphasis on the long head due to the stretched position.",
                    "limitations": "Can feel more awkward and harder to control than barbell or easy bar versions.",
                    "alternative_options": "Allows for training each arm individually, unlike barbell versions.",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "JM Press (Smith Machine)",
                    "setup_notes": "The Smith machine locks you into a fixed movement path.",
                    "execution_notes": "none",
                    "tier_reasons": "The fixed movement path of the Smith machine makes it easier to focus on using the triceps to move the weight, reducing the tendency for the pecs and delts to take over, which can happen with a barbell. This improves the 'feels good' aspect for triceps engagement.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Triceps.",
                    "limitations": "none",
                    "alternative_options": "Fixes some of the issues Jeff experiences with the barbell JM press by providing a more stable and triceps-focused movement.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff personally prefers JM presses on the Smith machine."
                },
                {
                    "exercise_name": "Cable Triceps Kickbacks",
                    "setup_notes": "none",
                    "execution_notes": "Hold the arm back behind the torso. This can be done bent forward or more upright, as biomechanically it's the same. Focus on getting a big, strong contraction in the triceps.",
                    "tier_reasons": "This is one of the few exercises that works the triceps with the arm held back behind the torso, which is important because the long head of the triceps reaches peak contraction in this position. The cable provides nice even tension throughout the range of motion, and the exercise feels good to Jeff. The lateral and medial heads can still get decently stretched.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "All three heads, with particular emphasis on the long head due to peak contraction when the arm is held back behind the torso. Lateral and medial heads also get a decent stretch.",
                    "limitations": "Research suggests triceps respond better to long muscle lengths, and this exercise biases the shortened position, but the evidence isn't strong enough to discard all short-biased exercises.",
                    "alternative_options": "Compared to dumbbell kickbacks, cable kickbacks are more effective because the cable provides tension throughout the range of motion, unlike dumbbells which offer zero tension at the stretched position.",
                    "scientific_insights": "Research suggests that the triceps respond better to long muscle lengths, though this exercise biases the shortened position.",
                    "additional_notes": "This is the first exercise covered that gets the long head into a full squeeze. Jeff prefers to do these with slightly higher reps."
                },
                {
                    "exercise_name": "Close Grip Bench Press",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "This exercise has an incredible capacity for progressive overload, allowing gradual addition of weight each week for long-term triceps growth. The bar provides consistent tension throughout the range of motion, and Jeff finds he can engage his triceps better here than on dips. However, the long head is not hit as hard because it lengthens at the shoulder joint while simultaneously shortening at the elbow joint. This limitation prevents it from being S-tier.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Medial and lateral heads are smashed extremely well. The long head is not hit all that hard.",
                    "limitations": "The long head does not grow as well from this exercise as it would from an overhead extension.",
                    "alternative_options": "Jeff finds he can engage his triceps a lot better here than on dips.",
                    "scientific_insights": "none",
                    "additional_notes": "This is definitely an exercise worth doing if you're trying to grow your triceps."
                }
            ],
            "B-Tier": [
                {
                    "exercise_name": "Press Down (Rope)",
                    "setup_notes": "none",
                    "execution_notes": "Drive the handles apart at the bottom to feel a harder contraction.",
                    "tier_reasons": "The ability to drive the handles apart can help some people feel a harder contraction, contributing to the 'feels good' aspect. However, the rope attachment is less rigid and stable, leading to tension loss through forearm stabilization, which limits the ability to overload the triceps. An experiment showed 12 reps with the rope versus 16 reps with the bar at the same weight.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "All three heads, but probably grows the medial and lateral heads a little better than the long head.",
                    "limitations": "Limits the ability to load as much tension onto the triceps due to instability.",
                    "alternative_options": "Compared to the bar press down, the rope is less stable and leads to less overload. The motion of driving handles apart is mainly at the wrists, offering more of a mind-muscle connection benefit than real contractile benefit to the triceps.",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "Dumbbell French Press",
                    "setup_notes": "Jeff likes to do these seated for increased stability.",
                    "execution_notes": "none",
                    "tier_reasons": "This exercise gets the long head very stretched. Performing it seated enhances stability, allowing more tension to be directed to the triceps. However, the dumbbell provides a circular resistance path, meaning there's a lot of tension at the bottom (stretched position) and less tension at the top, which is not as uniform as cables. A main issue is that as triceps get stronger, dumbbells can become bulky and awkward to handle, potentially causing unwanted strain on the wrists.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Long head (very stretched).",
                    "limitations": "Circular resistance path (tension is not uniform, with less at the top). Dumbbells can become bulky and awkward, potentially causing wrist strain as strength increases.",
                    "alternative_options": "Compared to cables, dumbbells do not offer the same uniform tension. The stretched aspect seems more important, so the resistance curve isn't a deal-breaker.",
                    "scientific_insights": "none",
                    "additional_notes": "Faster to set up than cables. Jeff still includes these periodically but prefers cables."
                },
                {
                    "exercise_name": "JM Press (Barbell)",
                    "setup_notes": "none",
                    "execution_notes": "This is a hybrid between a close grip bench press and a skull crusher. Instead of lowering the bar back behind your head or down to your chest, you meet in the middle and lower the bar down to your chin area.",
                    "tier_reasons": "Jeff experiences elbow pain or discomfort when performing this exercise, causing it to lose points in the 'feels good' department. Because the arms are not as far back behind the head, the long head does not get as stretched as it would in a skull crusher. It is considered a solid lift with some strength carryover to the bench press, and it hits the triceps from a different shoulder angle.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Triceps, but the long head is not as stretched as in a skull crusher.",
                    "limitations": "Can cause elbow pain or discomfort for some individuals. The long head is not as stretched as in other overhead exercises.",
                    "alternative_options": "Hybrid between close grip bench press and skull crusher.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff considers this exercise a bit overrated in the strength and powerlifting space. He has tried them for years and always feels discomfort. He suggests that if you're already doing bench press and overhead extensions, a JM press might not be necessary."
                },
                {
                    "exercise_name": "Close Grip Dips",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "This exercise works the triceps with the arms back behind the torso, offering a strong contraction of the long head. As a compound exercise, it's great for progressive overload, allowing for easy addition of reps or weight with a belt. However, the long head never gets a deep stretch because the arms aren't up overhead. Jeff finds his shoulders get cranky, and his pecs and delts can easily take over, which negatively impacts the 'feels good' aspect and triceps isolation.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Long head (strong contraction).",
                    "limitations": "The long head never gets a deep stretch. Can cause shoulder discomfort for some. Pecs and delts can easily take over the movement.",
                    "alternative_options": "none",
                    "scientific_insights": "none",
                    "additional_notes": "On paper, this exercise probably should be an A or S tier, but personal discomfort and difficulty isolating the triceps lead to a lower ranking for Jeff."
                },
                {
                    "exercise_name": "Machine Dips",
                    "setup_notes": "This is a more locked-in version of a free dip.",
                    "execution_notes": "none",
                    "tier_reasons": "Machine dips offer more stability than free dips, which can help individuals connect better with their triceps. However, Jeff still finds that his pecs and delts can take over on some machines, reducing triceps isolation.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Triceps.",
                    "limitations": "Pecs and delts can still take over on some machines.",
                    "alternative_options": "A more locked-in version of a free dip.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff doesn't do them a lot in his own training, preferring cable kickbacks, but might add them back in for his next training phase."
                },
                {
                    "exercise_name": "Diamond Push-ups",
                    "setup_notes": "Narrow the base of support.",
                    "execution_notes": "The exercise puts you in a more flared elbow position.",
                    "tier_reasons": "Diamond push-ups make the movement considerably harder than close grip push-ups, and most people can feel their triceps working harder due to the more flared elbow position. While not as good as a close grip bench press for progressive overload, they are effective enough for B-tier.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Triceps.",
                    "limitations": "Still not as good as a close grip bench press for progressive overload.",
                    "alternative_options": "Makes the movement considerably harder than close grip push-ups.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff really likes diamond push-ups as a finisher exercise at the end of a workout, where you can go for as many reps as possible. They are a lot harder than they look."
                }
            ],
            "C-Tier": [
                {
                    "exercise_name": "Press Down (Reverse Grip)",
                    "setup_notes": "none",
                    "execution_notes": "Perform with an underhand grip (palms up).",
                    "tier_reasons": "Turning your palms up does not significantly change triceps biomechanics but limits strength output, especially if grip becomes a limiting factor. An experiment showed only 10 reps with an underhand grip, making it the weakest of the three press down options. While some people feel it hits their triceps better (possibly due to forearm bones being out of the way), Jeff doubts it's worth the reduction in overload potential.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "none",
                    "limitations": "Limits strength output and can make grip a limiting factor.",
                    "alternative_options": "Considered the worst of the three press down options (rope, bar, reverse grip).",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "Dumbbell Triceps Kickbacks",
                    "setup_notes": "none",
                    "execution_notes": "Hold the arm back behind the torso.",
                    "tier_reasons": "This exercise is less effective than cable kickbacks because the dumbbell offers zero tension while the tricep is stretched, and tension only increases as the muscle contracts. This is not ideal, as tension should be biased toward the stretched aspect for optimal growth. It does the exact opposite of what is desired for tension profile.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Long head (peak contraction).",
                    "limitations": "Offers zero tension while the tricep is stretched, and tension increases as the muscle contracts, which is not ideal for muscle growth.",
                    "alternative_options": "Less effective than cable kickbacks. If only dumbbells are available, overhead extensions are recommended for more 'bang for your buck'.",
                    "scientific_insights": "none",
                    "additional_notes": "Jeff believes they are a little overhated online but are still not one of his go-to exercises. This exercise is crowned as the 'worst of the worst'."
                },
                {
                    "exercise_name": "Bench Dips",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "While bench dips work the triceps in a similar shoulder position to close grip dips and Jeff finds they take the pecs and delts out of the movement better, allowing for a better triceps connection, their fatal flaw is in the progressive overload department. As triceps strength increases, the exercise quickly becomes not challenging enough in a normal rep range. Adding weight (e.g., having a partner load weight in your lap) is often awkward to balance.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Triceps.",
                    "limitations": "Poor for progressive overload; quickly becomes too easy, and adding weight is awkward to balance.",
                    "alternative_options": "Takes pecs and delts out of the movement better than close grip dips, allowing for better triceps connection.",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                },
                {
                    "exercise_name": "Close Grip Push-up",
                    "setup_notes": "none",
                    "execution_notes": "none",
                    "tier_reasons": "This exercise has very similar biomechanics to the close grip bench press, meaning it hits the lateral and medial heads harder than the long head. The main issue is that beyond the beginner stage, it's very difficult to overload them effectively without doing a ton of reps or having a partner awkwardly load weight on your back.",
                    "target_muscles": [
                        "Triceps"
                    ],
                    "target_muscle_parts": "Lateral and medial heads (harder than the long head).",
                    "limitations": "Very hard to overload effectively beyond the beginner stage.",
                    "alternative_options": "Very similar biomechanics to the close grip bench press.",
                    "scientific_insights": "none",
                    "additional_notes": "none"
                }
            ]
        }
    },
    "main_knowledge_summary": {
        "muscle_group": [
            "Triceps (Lateral Head)",
            "Triceps (Medial Head)",
            "Triceps (Long Head)"
        ],
        "criterias": [
            {
                "High tension, especially in the stretched position": "The exercise should place significant tension on the triceps, particularly when the muscle is in its most lengthened state."
            },
            {
                "Feels good": "The exercise should not cause pain and should have a smooth, consistent resistance profile throughout the movement."
            },
            {
                "Simple progression": "It should be easy to progressively overload the exercise by adding weight or increasing repetitions week to week."
            }
        ],
        "muscle_part_anatomy_function": [
            {
                "Long Head of Triceps": "Beefs up the triceps from the rear. It is the only head that crosses both the elbow joint and the shoulder joint. Its primary function is elbow extension, but it also performs shoulder extension (moving the arm down). It is more stretched when the arm is up overhead and more contracted when the arm is held back behind the torso."
            },
            {
                "Lateral Head of Triceps": "Gives the triceps a 'rant' shape. Primarily functions in elbow extension."
            },
            {
                "Medial Head of Triceps": "Runs down the middle, adding shape to the arm as a whole. Primarily functions in elbow extension."
            }
        ],
        "form_details": "When performing **Rope Press Downs**, driving the handles apart at the bottom can enhance mind-muscle connection, though it offers minimal additional contractile benefit. For **Bar Press Downs**, the bar provides more stability, directing tension to the triceps. **Reverse Grip Press Downs** involve turning palms up, which biomechanically doesn't significantly alter triceps activation but can limit strength output due to grip. For **Overhead Cable Triceps Extensions**, the arms are moved up overhead to maximize long head stretch. **Katana Triceps Extensions** involve crossing arms overhead and grabbing the opposite side's cable; starting with cables at or just above waist height positions the arms about 30-40 degrees forward (scapular plane) for comfort. **Dumbbell French Press** is best performed seated for stability. For **Skull Crushers**, arc the bar back behind your head instead of stopping at your skull to achieve a greater stretch. Using an easy bar can alleviate wrist strain. To optimize tension, start the range of motion with elbows slightly back, then arc the weight back. **JM Press** is a hybrid movement where the bar is lowered to the chin area, not behind the head or to the chest. For **Triceps Kickbacks**, the movement can be performed bent forward or more upright; biomechanically, the effect on the triceps is similar, focusing on contracting the long head with the arm held back.",
        "training_keys": "For maximal triceps growth, pressing exercises alone are insufficient, especially for the long head. It is crucial to incorporate triceps isolation work. The most effective isolation exercises are those that train the triceps with the arms overhead, as this allows the long head to experience high tension in a deep stretch. To ensure proportional triceps development, train the muscle group from a variety of different shoulder angles. This should include at least one movement with the arms up overhead (e.g., overhead extension), one with the arms down at the sides (e.g., press down), and/or one with the arm held back behind the torso (e.g., cable kickback).",
        "research_insights": "A **2023 study** found that **overhead extensions** caused approximately **40% more triceps growth than press downs**. This research highlights the importance of training the long head of the triceps in a more lengthened position, suggesting that placing the long head under a significant stretch contributes substantially to overall muscle growth. The overhead cable triceps extension is cited as an exercise validated as superior in long-term hypertrophy studies.",
        "optimization_notes": "To optimize triceps workouts, prioritize exercises that provide high tension in the stretched position, feel good without causing pain, and allow for simple progressive overload. For exercises like **Rope Press Downs**, while they may 'feel good,' the rope's instability can limit the ability to overload compared to a bar. For **Dumbbell French Press**, consider switching to one-arm variations or cables as dumbbells can become awkward and strain wrists as strength increases. For **Skull Crushers**, using an easy bar can improve comfort and allow for better overload. **Dumbbell Kickbacks** are less effective than cable versions due to the resistance profile, which offers zero tension in the stretched position; if only dumbbells are available, overhead extensions are a better alternative. For **Close Grip Dips** and **Close Grip Bench Press**, leverage their high capacity for progressive overload by consistently adding weight or reps. For **Close Grip Push-ups**, consider **Diamond Push-ups** as a more challenging finisher, but acknowledge their limitations for progressive overload compared to weighted exercises."
    }
}