{
    "workout_title": "ERROR: requested total duration (0.0 min) too short for required warm-up",
    "total_workout_duration": 6.0,
    "num_exercises": 0,
    "warmup": {
        "warmup_duration": 6.0,
        "warmup_exercises": [
            {
                "exercise_name": "Arm Circles",
                "setup": "Stand tall with feet shoulder-width apart, arms extended straight out to the sides at shoulder height, palms facing down.",
                "execution": "Begin with small controlled forward circles, gradually increasing the circle diameter; after 30 seconds switch direction and perform backward circles. Keep the shoulders down and the torso stable. Perform 1 set forward + 1 set backward for a total duration of 60s."
            },
            {
                "exercise_name": "Scapular Push-Ups",
                "setup": "Start in a high plank position with hands under shoulders, body in a straight line from head to heels.",
                "execution": "Without bending the elbows, pinch the shoulder blades together (squeeze) then push them apart (protract) to move the upper back up and down. Move slowly and focus on scapular control. Perform 2 sets of 8-10 reps; total duration ~60s."
            },
            {
                "exercise_name": "Torso Twists (Standing)",
                "setup": "Stand with feet hip-width apart, knees slightly bent, hands lightly clasped at chest or extended in front at shoulder height.",
                "execution": "Rotate the torso to the right in a controlled manner, then back through center to the left. Maintain a tall posture and keep hips facing forward while the thoracic spine rotates. Perform 1 set of 20 total reps (10 each side); duration 60s."
            },
            {
                "exercise_name": "Jumping Jacks (or Low-Impact Step-Outs)",
                "setup": "Stand tall with feet together and arms at sides. For low-impact, prepare to step side-to-side instead of jumping.",
                "execution": "Perform regular jumping jacks if appropriate; otherwise step the right foot out while raising arms overhead, return to center, then step the left foot out and repeat. Keep a steady rhythm to raise heart rate moderately. Perform 1 continuous set for 90s."
            },
            {
                "exercise_name": "Bodyweight Hip Hinge (Good Morning)",
                "setup": "Stand with feet hip-width apart, knees soft, hands lightly placed behind the head or crossed on chest.",
                "execution": "Hinge at the hips by pushing them back while keeping a neutral spine, feeling a stretch in the hamstrings, then drive the hips forward to stand upright. Keep core engaged and avoid rounding the back. Perform 2 sets of 8-10 reps; total duration ~90s."
            }
        ]
    },
    "sets": []
}