{
    "workout_title": "Beginner Biceps Focus — Vertical + Horizontal Pulls + Curls",
    "total_workout_duration": 14.34,
    "num_exercises": 3,
    "warmup": {
        "warmup_duration": 5.5,
        "warmup_exercises": [
            {
                "exercise_name": "Arm Circles (Forward and Backward)",
                "setup": "Stand tall with feet hip-width apart and arms extended straight out to the sides at shoulder height.",
                "execution": "Perform controlled small-to-medium circles forward for 30 seconds, then reverse and perform backward circles for 30 seconds. Keep shoulders relaxed and move through a comfortable range. (Sets: 1 set; Duration: 60 seconds.)"
            },
            {
                "exercise_name": "Dynamic Arm Swings (Cross‑Body and Overhead)",
                "setup": "Stand tall with feet hip-width apart, arms relaxed at your sides.",
                "execution": "Swing one arm across your chest while the other swings out and overhead, alternating arms in a controlled, rhythmic manner to mobilize shoulders and chest. Do this continuously for 60 seconds. (Sets: 1 set; Duration: 60 seconds.)"
            },
            {
                "exercise_name": "Wall Slides",
                "setup": "Stand with your back or front facing a wall (choose the orientation that allows you to keep forearms/wrists contacting the wall). Feet about 6–12 inches from the wall.",
                "execution": "Press forearms and palms (as much as you can) into the wall. Keeping contact, slide arms up overhead as far as your mobility allows, then slide them back down. Move smoothly and maintain scapular contact. Perform for 60 seconds. (Sets: 1 set; Duration: 60 seconds.)"
            },
            {
                "exercise_name": "Prone Y‑T‑W‑L Scapular Activations",
                "setup": "Lie face down on a mat or the floor with arms extended. If needed, place a small folded towel under forehead for comfort.",
                "execution": "Lift the arms slightly off the floor and cycle through: Y (arms overhead in a Y), T (arms straight out to sides), W (elbows bent and pull), and L (elbow bent 90° and rotate). Hold each position 1–2 seconds focusing on scapular retraction and depression. Perform the full sequence for ~90 seconds. (Sets: 1 sequence; Duration: 90 seconds.)"
            },
            {
                "exercise_name": "Wrist and Elbow Mobility Circles",
                "setup": "Stand or sit comfortably with arms relaxed.",
                "execution": "Rotate wrists slowly in both directions for 15 seconds each. Then perform gentle controlled elbow flexion and extension for 30 seconds to prime the elbow joint and surrounding soft tissue. (Sets: 1; Duration: 30 seconds.)"
            },
            {
                "exercise_name": "Light Bodyweight Horizontal Pull / Scapular Retraction (Scapular Pulls on Low Surface)",
                "setup": "Find a low sturdy table edge, counter, or perform standing scapular squeezes with hands at hip level.",
                "execution": "With arms extended, pull your shoulder blades down and together without bending the elbows (scapular retraction). Hold briefly and relax. Repeat for 10 slow, deliberate reps to prime the scapular retractors and elbow flexors. (Sets: 1; Reps: 10; Duration: ~40 seconds.)"
            }
        ]
    },
    "sets": [
        {
            "set_number": 1,
            "set_strategy": "None",
            "set_duration": 1.4,
            "set_repetitions": 8,
            "target_muscle_group": [
                "biceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Assisted Chin-Up (Underhand Grip) or Negative Chin-Up",
                    "target_muscle_part": [
                        {
                            "biceps": [
                                "biceps brachii (long head)",
                                "biceps brachii (short head)",
                                "brachialis"
                            ]
                        },
                        {
                            "back": [
                                "latissimus dorsi",
                                "teres major",
                                "rhomboids"
                            ]
                        }
                    ],
                    "setup": "Find a pull-up bar or an assisted pull-up machine. For band assistance, loop a resistance band under the knees or feet and hang the band over the bar. For assisted machine, set the assistance so you can complete 8 controlled reps. For negatives (no assistance available), use a box or step to get your chin above the bar at the start of each rep.",
                    "execution": [
                        "1. Grip the Bar: Use an underhand (supinated) grip roughly shoulder-width apart, palms facing you.",
                        "2. Set Starting Position: Hang from the bar with arms fully extended. Retract (pull down and together) your shoulder blades to stabilize the shoulders and engage the upper back.",
                        "3. Initiate the Pull: Drive your elbows down and back while pulling your chest toward the bar. Keep the torso tight and avoid excessive swinging or kipping.",
                        "4. Top Position: Pull until your chin clears the bar or your chest approaches the bar. Pause briefly and squeeze the biceps and upper back.",
                        "5. Lower (Eccentric): Lower with control for 3–5 seconds (for negatives emphasize a slow descent). If using assistance, control both the concentric (up) and eccentric (down) phases.",
                        "6. Breathe: Exhale as you pull up, inhale as you lower.",
                        "7. Repeat for 8 total reps with consistent tempo and form."
                    ],
                    "media_url": "https://www.youtube.com/watch?v=brhRXlOhsAM",
                    "reps": "8 reps",
                    "weight": "Select an assistance level (machine setting or resistance band) that allows you to complete 8 controlled reps with the last 1–2 reps feeling challenging but doable (Rate of Perceived Exertion 7–8 out of 10). If using the assisted machine, reduce assistance slightly if the set feels easy. For negatives (no assistance), perform 8 reps where you step or jump to the top and lower yourself in a controlled 3–5 second descent.",
                    "alternative_equipments": "Resistance band (looped under knees or feet) or assisted pull-up machine",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Inverted Row (Underhand Grip)",
                    "alternative_exercise_setup": "Set a bar in a squat rack or use a low bar/TRX at about waist height. Lie under the bar with feet on the floor, body in a straight line from head to heels. Grip the bar with an underhand (supinated) grip, roughly shoulder-width.",
                    "alternative_exercise_execution": "1. Start with arms extended and body straight, core braced. 2. Retract the shoulder blades to initiate the movement. 3. Pull your chest toward the bar by flexing the elbows until your sternum approaches the bar. 4. Lower with control back to full arm extension. 5. Keep the body rigid (no sagging or hips rising). Perform 10 controlled reps.",
                    "alternative_exercise_media_url": "https://www.youtube.com/watch?v=FpP2a3qGa6k",
                    "alternative_exercise_reps": "10 reps",
                    "alternative_exercise_weight": "Adjust intensity by changing torso angle: more horizontal (lower bar or raise feet) increases difficulty; more vertical (raise bar) decreases it. If 10 strict reps are too easy, elevate feet or place a small 5–10 lb (2.5–4.5 kg) plate on the chest to increase load until the 10th rep is challenging (RPE 7–8).",
                    "additional_tips": "Keep scapula retracted throughout the set. Avoid kicking or using momentum. If shoulders feel strained, focus on scapular pulls (short range) and build scapular control before full reps. If band colors confuse you, pick the band that lets you finish 8 reps with effort on the last 2 reps."
                }
            ]
        },
        {
            "set_number": 2,
            "set_strategy": "None",
            "set_duration": 1.4,
            "set_repetitions": 8,
            "target_muscle_group": [
                "biceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Assisted Chin-Up (Underhand Grip) or Negative Chin-Up",
                    "target_muscle_part": [
                        {
                            "biceps": [
                                "biceps brachii (long head)",
                                "biceps brachii (short head)",
                                "brachialis"
                            ]
                        },
                        {
                            "back": [
                                "latissimus dorsi",
                                "teres major",
                                "rhomboids"
                            ]
                        }
                    ],
                    "setup": "Use the same assisted pull-up machine, band setup, or step-for-negative method as Set 1. Keep the grip and body position consistent with Set 1.",
                    "execution": [
                        "1. Grip the bar underhand, shoulder-width.",
                        "2. Start from a dead hang with scapula retracted.",
                        "3. Pull up with controlled elbow flexion, aiming to bring the chest or chin to the bar.",
                        "4. Lower with control for 3–5 seconds if performing negatives; otherwise control the eccentric normally.",
                        "5. Breathe out on the concentric and inhale on the descent.",
                        "6. Complete 8 reps focusing on the same tempo and range of motion you used in Set 1."
                    ],
                    "media_url": "https://www.youtube.com/watch?v=brhRXlOhsAM",
                    "reps": "8 reps",
                    "weight": "Maintain the same assistance level as Set 1. If Set 1 felt much easier than intended, slightly reduce assistance so the final 1–2 reps feel challenging. For negative-only sets, keep eccentric at 3–5 seconds per rep.",
                    "alternative_equipments": "Resistance band or assisted pull-up machine",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Inverted Row (Underhand Grip)",
                    "alternative_exercise_setup": "Same setup as described for Set 1 alternative: bar at waist height or TRX, body straight underneath bar.",
                    "alternative_exercise_execution": "Perform 10 controlled underhand inverted rows: retract scapula, pull chest toward bar, pause briefly, then lower with control. Maintain a straight plank from head to heels.",
                    "alternative_exercise_media_url": "https://www.youtube.com/watch?v=FpP2a3qGa6k",
                    "alternative_exercise_reps": "10 reps",
                    "alternative_exercise_weight": "Keep the same torso angle/foot elevation used for Set 1. If Set 1 felt too easy, lower the bar or raise feet so the 10th rep is difficult but doable. Use a 5–10 lb (2.5–4.5 kg) chest plate only if you can maintain a rigid body line and strict form.",
                    "additional_tips": "Match tempo and technique to Set 1. Watch for creeping momentum—if you start to swing, reduce load or increase rest. Shorten the eccentric slightly if your grip is fatiguing too fast."
                }
            ]
        },
        {
            "set_number": 3,
            "set_strategy": "None",
            "set_duration": 1.67,
            "set_repetitions": 10,
            "target_muscle_group": [
                "biceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Inverted Row (Underhand/Close Grip)",
                    "target_muscle_part": [
                        {
                            "biceps": [
                                "biceps brachii (both heads)",
                                "brachialis"
                            ]
                        },
                        {
                            "back": [
                                "posterior deltoid",
                                "rhomboids",
                                "middle trapezius"
                            ]
                        }
                    ],
                    "setup": "Place a bar in a rack or use a TRX/suspension trainer so the bar/handles are about waist height. Lie under the bar with feet flat on the floor and body in a straight line. Use an underhand (supinated) close grip.",
                    "execution": [
                        "1. Starting Position: Arms extended, body straight from head to heels, core braced.",
                        "2. Scapular Set: Retract the shoulder blades before the pull to initiate the movement with your back muscles.",
                        "3. Pull: Flex the elbows and pull your chest toward the bar until your sternum touches or approaches the bar. Keep elbows close to the body to emphasize biceps.",
                        "4. Top Position: Pause briefly and squeeze the upper back and biceps.",
                        "5. Lower: Lower under control to full arm extension while maintaining a rigid body line.",
                        "6. Repeat for 10 reps, keeping consistent tempo and full range of motion."
                    ],
                    "media_url": "https://www.youtube.com/watch?v=FpP2a3qGa6k",
                    "reps": "10 reps",
                    "weight": "Bodyweight intensity is set by torso angle. Choose a bar height where the 10th rep is 1–2 reps shy of failure (RPE 7–8). If 10 reps is too easy, raise your feet onto a box or lower the bar so your torso is more horizontal. If too hard, raise the bar to a more vertical position.",
                    "alternative_equipments": "TRX or suspension trainer, low bar in rack",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Dumbbell Biceps Curl (Standing)",
                    "alternative_exercise_setup": "Stand tall with feet hip-width apart holding a dumbbell in each hand, arms fully extended, palms facing forward (supinated). Brace your core.",
                    "alternative_exercise_execution": "1. Keep elbows close to your sides and stable. 2. Curl the dumbbells up by flexing at the elbows until dumbbells reach shoulder level. 3. Squeeze the biceps at the top for 0.5–1 second. 4. Lower with a controlled eccentric for ~2–3 seconds back to full extension. 5. Avoid swinging the torso. Perform 12 strict reps.",
                    "alternative_exercise_media_url": "https://www.youtube.com/watch?v=ykJmrZ5v0Oo",
                    "alternative_exercise_reps": "12 reps",
                    "alternative_exercise_weight": "Select dumbbells that allow 12 strict reps with the last 1–2 reps feeling challenging (RPE 7–8). If unfamiliar, start around 10–20 lb (4.5–9 kg) per dumbbell and adjust based on ability: increase if you can do >14 reps, decrease if you cannot reach 10.",
                    "additional_tips": "Maintain a straight body line to keep load on the upper back and biceps. Actively retract the scapula before each rep to improve muscle recruitment. If grip fails before back/biceps, consider thicker grip handles or straps after mastery of form."
                }
            ]
        },
        {
            "set_number": 4,
            "set_strategy": "None",
            "set_duration": 1.67,
            "set_repetitions": 10,
            "target_muscle_group": [
                "biceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Inverted Row (Underhand/Close Grip)",
                    "target_muscle_part": [
                        {
                            "biceps": [
                                "biceps brachii (both heads)",
                                "brachialis"
                            ]
                        },
                        {
                            "back": [
                                "posterior deltoid",
                                "rhomboids",
                                "middle trapezius"
                            ]
                        }
                    ],
                    "setup": "Use the same bar height and body position as Set 3. Ensure hands are under the shoulders with a close underhand grip.",
                    "execution": [
                        "1. Start in a straight plank under the bar with arms extended and core braced.",
                        "2. Pull by driving elbows down and back, bringing the chest toward the bar while keeping elbows fairly close to the body to emphasize elbow flexion.",
                        "3. Pause briefly at the top and control the descent to full extension.",
                        "4. Keep the hips neutral — do not sag or hike the hips.",
                        "5. Complete 10 reps with steady tempo and full range of motion."
                    ],
                    "media_url": "https://www.youtube.com/watch?v=FpP2a3qGa6k",
                    "reps": "10 reps",
                    "weight": "Keep the same torso angle/foot elevation as Set 3. If Set 3 was easier than intended, make your body more horizontal (lower bar or raise feet) so the 10th rep is challenging. If using added weight, 5–10 lb (2.5–4.5 kg) on the chest is a small, controlled increment.",
                    "alternative_equipments": "TRX, suspension trainer, low bar in a rack",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Dumbbell Biceps Curl (Standing)",
                    "alternative_exercise_setup": "Stand with feet hip-width, dumbbells in hands, palms supinated (facing forward), elbows close to body.",
                    "alternative_exercise_execution": "Curl the dumbbells to shoulder height with elbows stationary, squeeze at the top 0.5–1 second, then lower for 2–3 seconds. Maintain strict form for 12 reps.",
                    "alternative_exercise_media_url": "https://www.youtube.com/watch?v=ykJmrZ5v0Oo",
                    "alternative_exercise_reps": "12 reps",
                    "alternative_exercise_weight": "Use the same guideline as Set 3 alternative: choose a weight that makes 12 strict reps challenging but achievable. Adjust by 2.5–5 lb (1–2.5 kg) increments where possible.",
                    "additional_tips": "If fatigue causes the hips to sag, reduce difficulty (raise bar) to preserve technique. Keep breathing steady and do not hold breath during reps."
                }
            ]
        },
        {
            "set_number": 5,
            "set_strategy": "None",
            "set_duration": 1.35,
            "set_repetitions": 12,
            "target_muscle_group": [
                "biceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Standing Dumbbell Biceps Curl (Supinated)",
                    "target_muscle_part": [
                        {
                            "biceps": [
                                "biceps brachii (both heads)",
                                "brachialis",
                                "brachioradialis"
                            ]
                        }
                    ],
                    "setup": "Stand tall with feet hip-width apart holding a dumbbell in each hand. Arms fully extended, palms facing forward (supinated). Keep a slight bend in the knees and brace the core.",
                    "execution": [
                        "1. Starting Position: Elbows close to torso, shoulders relaxed.",
                        "2. Curl: Flex at the elbow to raise the dumbbells toward shoulder height. Keep the elbows stationary—do not let them move forward.",
                        "3. Top Contraction: Squeeze the biceps for 0.5–1 second at the top of the movement.",
                        "4. Lower: Lower the weights with a controlled eccentric lasting about 2–3 seconds back to full extension.",
                        "5. Breathing: Exhale while lifting, inhale while lowering.",
                        "6. Repeat for 12 strict reps without swinging the torso. If swinging occurs, reduce the weight."
                    ],
                    "media_url": "https://www.youtube.com/watch?v=ykJmrZ5v0Oo",
                    "reps": "12 reps",
                    "weight": "Pick a dumbbell weight that allows 12 strict reps with the last 1–2 reps being challenging (Rate of Perceived Exertion 7–8). If unsure, start with 10–20 lb (4.5–9 kg) per hand and adjust: increase if you can do >14 with good form, decrease if you cannot reach 10 clean reps.",
                    "alternative_equipments": "EZ bar, straight barbell, cable machine",
                    "rest_time": "45 seconds",
                    "alternative_exercise": "Assisted Chin-Up (Underhand Grip) or Negative Chin-Up",
                    "alternative_exercise_setup": "Same setup as for Sets 1–2: assisted pull-up machine, resistance band looped under knees/feet, or a box for negative reps.",
                    "alternative_exercise_execution": "Perform 8 assisted chin-ups with consistent tempo or 8 negatives where you step up and lower in 3–5 seconds. Focus on controlled eccentrics.",
                    "alternative_exercise_media_url": "https://www.youtube.com/watch?v=brhRXlOhsAM",
                    "alternative_exercise_reps": "8 reps (or 8 controlled negatives)",
                    "alternative_exercise_weight": "Set machine assistance or choose a band that allows 8 reps with the last rep being 1–2 reps shy of failure. For negatives, no assistance weight is used—control descent for 3–5 seconds per rep.",
                    "additional_tips": "Keep wrists neutral—avoid excessive flexion or extension. If you feel elbow tendon soreness, reduce load, slow the tempo, and prioritize eccentric control. Focus on a full range of motion to maximize stimulus."
                }
            ]
        },
        {
            "set_number": 6,
            "set_strategy": "None",
            "set_duration": 1.35,
            "set_repetitions": 12,
            "target_muscle_group": [
                "biceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Standing Dumbbell Biceps Curl (Supinated)",
                    "target_muscle_part": [
                        {
                            "biceps": [
                                "biceps brachii (both heads)",
                                "brachialis",
                                "brachioradialis"
                            ]
                        }
                    ],
                    "setup": "Same as Set 5: stand with feet hip-width apart, dumbbells in hands, arms fully extended, palms forward.",
                    "execution": [
                        "1. Maintain an upright torso and braced core.",
                        "2. Curl the dumbbells with strict elbow flexion to shoulder level.",
                        "3. Hold for 0.5–1 second at the top, then lower for 2–3 seconds.",
                        "4. Keep shoulders back and down; do not let them lift to help the movement.",
                        "5. Complete 12 controlled repetitions with the same tempo and form as Set 5."
                    ],
                    "media_url": "https://www.youtube.com/watch?v=ykJmrZ5v0Oo",
                    "reps": "12 reps",
                    "weight": "Use the same dumbbells selected for Set 5. If Set 5 felt easy (could do 14+ strict reps), increase weight by the smallest available increment (2.5–5 lb / 1–2.5 kg). Maintain strict form and controlled 2–3 second eccentrics.",
                    "alternative_equipments": "EZ bar, barbell, cable machine",
                    "rest_time": "45 seconds",
                    "alternative_exercise": "Assisted Chin-Up (Underhand Grip) or Negative Chin-Up",
                    "alternative_exercise_setup": "Same assisted machine/band/step setup described previously.",
                    "alternative_exercise_execution": "Perform 8 assisted chin-ups or 8 controlled negatives focusing on a slow, controlled descent and full-range concentric when assisted.",
                    "alternative_exercise_media_url": "https://www.youtube.com/watch?v=brhRXlOhsAM",
                    "alternative_exercise_reps": "8 reps (or 8 controlled negatives)",
                    "alternative_exercise_weight": "Maintain the same assistance as earlier sets; reduce assistance over weeks as strength improves so 8 reps remain challenging.",
                    "additional_tips": "If forearms or grip limit you, use lighter dumbbells and slower eccentrics rather than swinging heavier weights. Track the weight used and aim to progress by small increments every 1–3 weeks."
                }
            ]
        }
    ]
}