{
    "sets": [
        {
            "set_number": 1,
            "set_time": 8.5,
            "set_strategy": "None",
            "set_repetitions": 3,
            "target_muscle_group": [
                "Back"
            ],
            "set_reasoning": "The Wide Grip Lat Pull Down is selected as the primary exercise to target the lats and mid traps, crucial for increasing back width. With 3 sets, this exercise provides a solid foundation for the user's weekly volume, aligning with the beginner's guideline of 3-6 sets per muscle group per session.",
            "exercises": [
                {
                    "exercise_name": "Wide Grip Lat Pull Down",
                    "target_muscle_part": {
                        "Back": [
                            "Lats",
                            "Mid Traps"
                        ]
                    },
                    "reps": "10-12",
                    "weight": "Select a weight that allows you to complete 10-12 reps with good form, typically around 60-70% of your 1RM.",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Neutral Grip Lat Pull Down",
                    "alternative_exercise_reps": "10-12",
                    "alternative_exercise_weight": "Choose a weight that allows for 10-12 reps with proper form, similar to the wide grip version."
                }
            ]
        },
        {
            "set_number": 2,
            "set_time": 8.5,
            "set_strategy": "None",
            "set_repetitions": 3,
            "target_muscle_group": [
                "Back"
            ],
            "set_reasoning": "The Neutral Grip Lat Pull Down is included to provide a slightly different stimulus to the lats, ensuring comprehensive development. This exercise complements the wide grip version, helping to meet the user's goal of increasing back width.",
            "exercises": [
                {
                    "exercise_name": "Neutral Grip Lat Pull Down",
                    "target_muscle_part": {
                        "Back": [
                            "Lats"
                        ]
                    },
                    "reps": "10-12",
                    "weight": "Select a weight that allows you to complete 10-12 reps with good form, typically around 60-70% of your 1RM.",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Wide Grip Pull-Up",
                    "alternative_exercise_reps": "10-12",
                    "alternative_exercise_weight": "Use body weight or add weight if needed to complete 10-12 reps."
                }
            ]
        },
        {
            "set_number": 3,
            "set_time": 8.5,
            "set_strategy": "None",
            "set_repetitions": 3,
            "target_muscle_group": [
                "Back"
            ],
            "set_reasoning": "The Half Kneeling One Arm Lat Pull Down is chosen for its unilateral focus, which is beneficial for beginners to address any muscle imbalances. This exercise also provides a high stretch and tension, effective for increasing back width.",
            "exercises": [
                {
                    "exercise_name": "Half Kneeling One Arm Lat Pull Down",
                    "target_muscle_part": {
                        "Back": [
                            "Lats"
                        ]
                    },
                    "reps": "10-12 per arm",
                    "weight": "Select a weight that allows you to complete 10-12 reps per arm with good form, typically around 60-70% of your 1RM.",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Cable Lat Pullover",
                    "alternative_exercise_reps": "10-12",
                    "alternative_exercise_weight": "Choose a weight that allows for 10-12 reps with proper form, focusing on the stretch and contraction of the lats."
                }
            ]
        }
    ],
    "workout_explanation": "This workout plan is structured to meet the user's goal of increasing back width, focusing on exercises that target the lats and mid traps. The exercises are selected based on their ability to provide a high stretch and tension, crucial for hypertrophy. The volume is designed to fit within the user's 30-minute time constraint, with each set including rest time estimated to be around 8.5 minutes, totaling 25.5 minutes for the entire session. This allows for a brief warm-up or cool-down if desired. The exercises are ordered to progressively target the back muscles, starting with bilateral movements and finishing with a unilateral exercise to address any imbalances. This structure aligns with the beginner's guidelines, emphasizing form and progressive overload while ensuring the workout is accessible and effective for someone with less than 3 months of experience."
}