{
    "exercises": [
        {
            "exercise_name": "Barbell Back Squat",
            "setup_notes": "Position the barbell on your upper traps.",
            "execution_notes": "Lock in your bar path, squat down deep, and stand back up.",
            "media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/03/barbell-full-squat.gif",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "High quad tension, feels good, excellent for progressive overload.",
            "targeted_muscles": [
                "Quadriceps"
            ],
            "targeted_muscle_parts": "All heads, with less emphasis on rectus femoris.",
            "limitations": "Requires spinal stabilization.",
            "scientific_insights": "Studies show solid rectus femoris growth despite anatomical concerns.",
            "additional_notes": "Include another exercise to fully engage rectus femoris.",
            "alternative_exercise": "Goblet Squat",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2023/08/kettlebell-goblet-squat-muscles.gif",
            "selection_reason": "The Barbell Back Squat is a fundamental compound exercise that effectively targets the quadriceps, aligning with the user's goal of achieving defined quads. It also indirectly engages the glutes, supporting the goal of lifted glutes. As a beginner-friendly exercise, it allows for progressive overload, which is crucial for muscle development."
        },
        {
            "exercise_name": "Stiff-Legged Deadlift",
            "setup_notes": "Use a barbell, similar to a conventional deadlift setup.",
            "execution_notes": "Keep hips high and knees more straight. Hinge at the hips to initiate the pull.",
            "media_url": "https://burnfit.io/wp-content/uploads/2023/11/DB_STIFF_DL.gif",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "None",
            "targeted_muscles": [
                "Hamstrings",
                "Glutes"
            ],
            "targeted_muscle_parts": "Focuses on the hamstrings due to the hip hinge movement.",
            "limitations": "Can be awkward for beginners; start light.",
            "scientific_insights": "None",
            "additional_notes": "Do not push too close to failure until comfortable with the technique.",
            "alternative_exercise": "Romanian Deadlift (RDL)",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2021/11/dumbbell-romanian-deadlift.gif",
            "selection_reason": "The Stiff-Legged Deadlift is an excellent choice for targeting the hamstrings and glutes, aligning with the user's goals of toned hamstrings and lifted glutes. It emphasizes the posterior chain, which is crucial for overall lower body strength and aesthetics. As a beginner, starting light and focusing on form will help in mastering this exercise."
        },
        {
            "exercise_name": "Leg Press",
            "setup_notes": "Use a leg press machine with a medium stance width.",
            "execution_notes": "Focus on deep range of motion without rounding the lower back. Maintain a slight knee bend at the top.",
            "media_url": "https://media.tenor.com/yBaS_oBgidsAAAAM/gym.gif",
            "alternative_equipment": "Hack Squat Machine",
            "tier_reasons": "High quad tension, but limited range of motion.",
            "targeted_muscles": [
                "Quadriceps"
            ],
            "targeted_muscle_parts": "Targets the quads, especially with a constant tension approach.",
            "limitations": "None",
            "scientific_insights": "None",
            "additional_notes": "Limit rest to 2 minutes between sets to maintain workout pace.",
            "alternative_exercise": "Hack Squat",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2023/03/v-squat.gif",
            "selection_reason": "The Leg Press is a beginner-friendly exercise that effectively targets the quadriceps, supporting the user's goal of defined quads. It allows for a controlled range of motion and is less technically demanding than free-weight squats, making it suitable for beginners."
        },
        {
            "exercise_name": "Glute Ham Raise",
            "setup_notes": "Use a GHR machine or set up on a lat pull-down machine with a counterbalance.",
            "execution_notes": "Stay in the active range, avoiding the top quarter of the movement.",
            "media_url": "https://www.youtube.com/embed/8zWDuWKdBZU?start=214&end=220",
            "alternative_equipment": "Nordic Hamstring Curl Bench",
            "tier_reasons": "None",
            "targeted_muscles": [
                "Hamstrings"
            ],
            "targeted_muscle_parts": "Focuses on the hamstrings by staying in the active range.",
            "limitations": "None",
            "scientific_insights": "None",
            "additional_notes": "Focus on controlling the negative portion of the movement.",
            "alternative_exercise": "Nordic Ham Curls",
            "alternative_exercise_media_url": "https://www.youtube.com/embed/8zWDuWKdBZU?start=214&end=220",
            "selection_reason": "The Glute Ham Raise is an effective exercise for isolating the hamstrings, aligning with the user's goal of toned hamstrings. It also engages the glutes, supporting the goal of lifted glutes. This exercise is beneficial for building strength and muscle endurance in the posterior chain."
        },
        {
            "exercise_name": "Barbell Hip Thrust",
            "setup_notes": "Sit on the ground with your upper back against a bench and a barbell over your hips.",
            "execution_notes": "Drive through your heels to lift your hips until they are fully extended, keeping a neutral pelvis.",
            "media_url": "None",
            "alternative_equipment": "Dumbbell",
            "tier_reasons": "None",
            "targeted_muscles": [
                "Gluteus Maximus"
            ],
            "targeted_muscle_parts": "Targets the upper glutes due to the position of the hips in full extension.",
            "limitations": "None",
            "scientific_insights": "A 2016 study by Contreras et al. found the barbell hip thrust resulted in the greatest upper glute activity.",
            "additional_notes": "A neutral pelvic position is recommended for optimal glute activation.",
            "alternative_exercise": "Single Leg Hip Thrusts",
            "alternative_exercise_media_url": "None",
            "selection_reason": "The Barbell Hip Thrust is a highly effective exercise for targeting the gluteus maximus, aligning with the user's goal of lifted glutes. It provides significant glute activation and is suitable for beginners, allowing for progressive overload and muscle growth."
        }
    ],
    "warmup": {
        "total_warmup_duration": 6.0,
        "warmup_exercises": [
            {
                "exercise_name": "Bodyweight Squats",
                "setup_notes": "Stand with feet shoulder-width apart.",
                "execution_notes": "Perform squats without weights, focusing on form and depth.",
                "sets_reps": "2 sets of 10 reps",
                "duration": "2 minutes"
            },
            {
                "exercise_name": "Leg Swings",
                "setup_notes": "Stand next to a wall for support.",
                "execution_notes": "Swing one leg forward and backward, then side to side.",
                "sets_reps": "1 set of 10 swings per leg",
                "duration": "2 minutes"
            },
            {
                "exercise_name": "Hip Circles",
                "setup_notes": "Stand with feet hip-width apart.",
                "execution_notes": "Rotate hips in a circular motion, first clockwise, then counterclockwise.",
                "sets_reps": "1 set of 10 circles each direction",
                "duration": "2 minutes"
            }
        ]
    }
}