{
    "exercises": [
        {
            "exercise_name": "Overhead Cable Triceps Extension",
            "setup_notes": "Position the cable at a low setting and use a bar attachment. Stand facing away from the cable machine with arms overhead.",
            "execution_notes": "Bend and extend the elbows while keeping the arms overhead. Ensure the cable provides tension throughout the range of motion.",
            "media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/11/overhead-cable-tricep-extension.gif",
            "alternative_equipment": "Dumbbell",
            "tier_reasons": "Provides high tension in the stretched position, feels good, and allows for simple progression. Validated by a 2023 study showing 40% more triceps growth than press downs.",
            "targeted_muscles": [
                "Triceps"
            ],
            "targeted_muscle_parts": "Long head, due to the overhead position providing a deep stretch.",
            "limitations": "None",
            "scientific_insights": "2023 study found overhead extensions caused about 40% more triceps growth than press downs.",
            "additional_notes": "None",
            "alternative_exercise": "Skull Crushers",
            "alternative_exercise_media_url": "",
            "selection_reason": "This exercise is selected as an S-Tier exercise for triceps, specifically targeting the long head due to the overhead position.  The deep stretch provided is crucial for triceps growth, as supported by research showing superior results compared to other triceps exercises. Its simple progression and good feel make it ideal for users of unknown experience levels."
        },
        {
            "exercise_name": "Close Grip Bench Press",
            "setup_notes": "Use a barbell, grip slightly narrower than shoulder-width.",
            "execution_notes": "Lower the bar to the chest, press back up.",
            "media_url": "https://framerusercontent.com/images/4vEMWneIoDWCqXvq17gyv8iAKc.gif",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "Great for overload, consistent tension, but long head not fully engaged.",
            "targeted_muscles": [
                "Triceps"
            ],
            "targeted_muscle_parts": "Medial and lateral heads, due to pressing motion.",
            "limitations": "Long head not fully engaged.",
            "scientific_insights": "None",
            "additional_notes": "Worth doing for triceps growth.",
            "alternative_exercise": "Bar Press Down",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2023/03/straight-bar-tricep-pushdown.gif",
            "selection_reason": "This A-Tier exercise complements the Overhead Cable Extension by targeting the medial and lateral heads of the triceps.  The ability to easily overload this exercise is beneficial for building strength and muscle mass. While it doesn't fully engage the long head, its inclusion provides a balanced triceps workout."
        },
        {
            "exercise_name": "Machine Chest Press",
            "setup_notes": "none",
            "execution_notes": "Ensure a deep stretch on the pecs with high tension throughout the range of motion. Maintain a stable position to enhance mind-muscle connection.",
            "media_url": "",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "Provides a deep stretch with high tension, smooth resistance profile, easy to overload, safer to push to failure.",
            "targeted_muscles": [
                "Pectorals"
            ],
            "targeted_muscle_parts": "none",
            "limitations": "none",
            "scientific_insights": "none",
            "additional_notes": "Find a machine that feels good at your gym for optimal results.",
            "alternative_exercise": "Bench Press",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/04/barbell-bench-press.gif",
            "selection_reason": "This S-Tier exercise is chosen for its ability to provide a deep stretch and high tension on the pectorals, crucial for muscle growth. The smooth resistance profile and ease of progressive overload make it suitable for all experience levels. The stability of the machine enhances mind-muscle connection."
        },
        {
            "exercise_name": "Incline Dumbbell Press",
            "setup_notes": "none",
            "execution_notes": "Perform similar to flat dumbbell press but with an incline.",
            "media_url": "https://fitnessprogramer.com/wp-content/uploads/2021/02/Incline-Dumbbell-Press.gif",
            "alternative_equipment": "Barbell",
            "tier_reasons": "Same benefits as flat dumbbell press with added upper pec emphasis.",
            "targeted_muscles": [
                "Pectorals"
            ],
            "targeted_muscle_parts": "Upper pecs",
            "limitations": "none",
            "scientific_insights": "none",
            "additional_notes": "none",
            "alternative_exercise": "Seated Cable Pec Fly",
            "alternative_exercise_media_url": "https://www.youtube.com/embed/fGm-ef-4PVk?start=649&end=661",
            "selection_reason": "This A-Tier exercise targets the upper pectorals, providing a balanced chest workout. The use of dumbbells allows for a greater range of motion and a deeper stretch compared to barbell variations.  It complements the Machine Chest Press, which focuses more on the overall chest."
        },
        {
            "exercise_name": "Overhead Cable Extension with Rope",
            "setup_notes": "Position the cable at a low setting and use a rope attachment.",
            "execution_notes": "Stand facing away from the cable machine with arms overhead, using a rope.",
            "media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/11/overhead-cable-tricep-extension.gif",
            "alternative_equipment": "Bar",
            "tier_reasons": "Provides high tension in the stretched position, but rope limits overload potential.",
            "targeted_muscles": [
                "Triceps"
            ],
            "targeted_muscle_parts": "Long head, due to the overhead position providing a deep stretch.",
            "limitations": "Rope limits overload potential.",
            "scientific_insights": "None",
            "additional_notes": "None",
            "alternative_exercise": "One Arm Dumbbell Tricep Extensions",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/03/tricep-overhead-extensions.gif",
            "selection_reason": "This A-Tier exercise provides another variation for triceps training, focusing on the long head. The rope attachment allows for a slightly different feel and muscle activation compared to the bar attachment used in the Overhead Cable Triceps Extension.  It's included to offer variety and potentially address individual preferences."
        },
        {
            "exercise_name": "Seated Cable Pec Fly",
            "setup_notes": "Sit down to increase stability and ensure all tension is applied directly to the pecs.",
            "execution_notes": "Perform fly movement with cables, ensuring a big stretch on the pecs with high tension.",
            "media_url": "https://www.youtube.com/embed/fGm-ef-4PVk?start=649&end=661",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "Provides a big stretch with high tension, stable, smooth tension throughout the range of motion.",
            "targeted_muscles": [
                "Pectorals"
            ],
            "targeted_muscle_parts": "none",
            "limitations": "none",
            "scientific_insights": "none",
            "additional_notes": "This is currently the favorite chest isolation movement.",
            "alternative_exercise": "Dumbbell Fly",
            "alternative_exercise_media_url": "https://newlife.com.cy/wp-content/uploads/2019/11/03081301-Dumbbell-Fly_Chest-FIX_360.gif",
            "selection_reason": "This S-Tier exercise is an isolation movement that targets the pectorals, providing a different stimulus compared to the compound movements. The seated position ensures stability and maximizes the stretch and tension on the pecs, promoting muscle growth and definition."
        }
    ],
    "warmup": {
        "total_warmup_duration": 7.0,
        "warmup_exercises": [
            {
                "exercise_name": "Arm Circles",
                "setup_notes": "Stand with feet shoulder-width apart.",
                "execution_notes": "Extend arms to the sides and make small circles forward for 30 seconds, then backward for 30 seconds.",
                "sets_reps": "2 sets",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Shoulder rotations",
                "setup_notes": "Stand tall with your feet shoulder-width apart.",
                "execution_notes": "Slowly rotate your shoulders forward in a circular motion for 30 seconds, then reverse the direction and rotate backward for 30 seconds.",
                "sets_reps": "2 sets",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Chest stretches",
                "setup_notes": "Clasp hands behind your back.",
                "execution_notes": "Slowly straighten your arms and lift them until you feel a stretch in your chest. Hold for 15 seconds. Repeat 2 times.",
                "sets_reps": "2 sets",
                "duration": "30 seconds"
            },
            {
                "exercise_name": "Triceps stretches",
                "setup_notes": "Raise one arm overhead and bend your elbow, letting your hand fall behind your head.",
                "execution_notes": "Gently pull your elbow toward your head with your other hand. Hold for 15 seconds. Repeat on the other side. Repeat 2 times.",
                "sets_reps": "2 sets",
                "duration": "30 seconds"
            },
            {
                "exercise_name": "Jumping Jacks",
                "setup_notes": "Stand with feet together, arms at your sides.",
                "execution_notes": "Jump, spreading your legs and raising your arms overhead. Return to starting position. Perform for 1 minute.",
                "sets_reps": "1 set",
                "duration": "1 minute"
            }
        ]
    }
}