{
    "exercises": [
        {
            "exercise_name": "Overhead Cable Triceps Extension",
            "setup_notes": "Position the cable at a low setting and use a bar attachment. Stand facing away from the cable machine with arms overhead.",
            "execution_notes": "Bend and extend the elbows while keeping the arms overhead. Ensure the cable provides tension throughout the range of motion.",
            "media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/11/overhead-cable-tricep-extension.gif",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "Provides high tension in the stretched position, feels good, and allows for simple progression. Validated by a 2023 study showing 40% more triceps growth than press downs.",
            "targeted_muscles": [
                "Triceps"
            ],
            "targeted_muscle_parts": "Long head, due to the overhead position providing a deep stretch.",
            "limitations": "None",
            "scientific_insights": "2023 study found overhead extensions caused about 40% more triceps growth than press downs.",
            "additional_notes": "None",
            "alternative_exercise": "Skull Crushers",
            "alternative_exercise_media_url": "",
            "selection_reason": "This exercise is selected as it's an S-Tier exercise according to the provided data, focusing on the long head of the triceps which is crucial for overall triceps development.  The overhead position ensures a deep stretch, promoting growth and aligning with the 'High Tension in Stretched Position' criteria. The study cited further supports its effectiveness."
        },
        {
            "exercise_name": "Skull Crushers",
            "setup_notes": "Use an EZ bar or straight bar. Lie on a bench with the bar overhead.",
            "execution_notes": "Lower the bar behind the head to increase stretch, then extend the elbows to lift the bar back up.",
            "media_url": "",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "High tension in stretched position, feels good with EZ bar, and allows for simple progression.",
            "targeted_muscles": [
                "Triceps"
            ],
            "targeted_muscle_parts": "Long head, due to the stretch when lowering the bar behind the head.",
            "limitations": "None",
            "scientific_insights": "None",
            "additional_notes": "None",
            "alternative_exercise": "Bar Press Down",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2023/03/straight-bar-tricep-pushdown.gif",
            "selection_reason": "This S-Tier exercise complements the Overhead Cable Extension by targeting the long head of the triceps from a different angle. The emphasis on stretching the muscle by lowering the bar behind the head aligns with the 'High Tension in Stretched Position' criteria.  It provides variety in the workout and ensures comprehensive triceps engagement."
        },
        {
            "exercise_name": "Bar Press Down",
            "setup_notes": "Attach a straight bar to a high pulley.",
            "execution_notes": "Stand facing the machine, grip the bar, and press down while keeping elbows close to the body.",
            "media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2023/03/straight-bar-tricep-pushdown.gif",
            "alternative_equipment": "Rope",
            "tier_reasons": "Stable movement, even tension throughout, easy to overload, but lacks stretch at the top.",
            "targeted_muscles": [
                "Triceps"
            ],
            "targeted_muscle_parts": "Medial and lateral heads, due to the pressing motion.",
            "limitations": "Does not stretch the triceps at the top.",
            "scientific_insights": "None",
            "additional_notes": "Recommended for weekly use.",
            "alternative_exercise": "Close Grip Bench Press",
            "alternative_exercise_media_url": "https://framerusercontent.com/images/4vEMWneIoDWCqXvq17gyv8iAKc.gif",
            "selection_reason": "This A-Tier exercise targets the medial and lateral heads of the triceps, providing a balanced approach to triceps training.  While it lacks the stretch of overhead movements, its stability and ease of overload make it a valuable addition for building overall triceps mass. It addresses the need for exercises that target different muscle parts."
        },
        {
            "exercise_name": "Cable Triceps Kickbacks",
            "setup_notes": "Use a cable machine with a low pulley.",
            "execution_notes": "Stand with the cable behind you, extend the arm back.",
            "media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2021/10/cable-tricep-pushdown.gif",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "Provides even tension, good contraction, especially for long head.",
            "targeted_muscles": [
                "Triceps"
            ],
            "targeted_muscle_parts": "Long head, due to arm position behind the torso.",
            "limitations": "None",
            "scientific_insights": "None",
            "additional_notes": "Focus on higher reps for strong contraction.",
            "alternative_exercise": "none",
            "alternative_exercise_media_url": "none",
            "selection_reason": "This A-Tier exercise further emphasizes the long head of the triceps, offering a different angle of attack compared to the overhead extensions and skull crushers. The consistent tension throughout the movement promotes muscle activation and growth."
        }
    ],
    "warmup": {
        "total_warmup_duration": 7.0,
        "warmup_exercises": [
            {
                "exercise_name": "Arm Circles",
                "setup_notes": "Stand with feet shoulder-width apart.",
                "execution_notes": "Extend arms to the sides and make small circles forward for 30 seconds, then backward for 30 seconds.",
                "sets_reps": "2 sets",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Shoulder rotations",
                "setup_notes": "Stand tall with feet shoulder-width apart.",
                "execution_notes": "Rotate shoulders forward in a circular motion for 30 seconds, then backward for 30 seconds.",
                "sets_reps": "2 sets",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Tricep stretches",
                "setup_notes": "Extend one arm overhead, bending at the elbow.",
                "execution_notes": "Gently pull the elbow towards the head with the other hand, holding for 15 seconds. Repeat on the other side.",
                "sets_reps": "2 sets per side",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Wrist rotations",
                "setup_notes": "Extend arms forward at shoulder height.",
                "execution_notes": "Rotate wrists clockwise for 30 seconds, then counterclockwise for 30 seconds.",
                "sets_reps": "2 sets",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Light cardio",
                "setup_notes": "none",
                "execution_notes": "Jumping jacks or high knees for 1 minute to increase blood flow.",
                "sets_reps": "1 set",
                "duration": "1 minute"
            }
        ]
    }
}