{
    "exercises": [
        {
            "exercise_name": "Preacher Curl",
            "setup_notes": "Use a preacher bench to angle your upper arm.",
            "execution_notes": "Ensure full range of motion by going all the way down and maintaining high tension in the stretched position.",
            "alternative_equipment": "Incline bench",
            "tier_reasons": "High tension in stretched position, locks elbows to prevent cheating, significant distal biceps growth.",
            "targeted_muscles": [
                "Biceps"
            ],
            "targeted_muscle_parts": "Distal biceps, due to high tension in stretched position.",
            "limitations": "None",
            "scientific_insights": "Study shows preacher curls cause more distal biceps growth compared to incline curls.",
            "additional_notes": "None",
            "alternative_exercise": "Incline Curl",
            "selection_reason": "Preacher curls are ideal for beginners as they lock the elbows, preventing cheating and ensuring proper form. They provide high tension in the stretched position, which is crucial for muscle growth, especially for the distal biceps, aligning with the user's goal of bigger biceps."
        },
        {
            "exercise_name": "Face Away Cable Curl",
            "setup_notes": "Set up the cable at hand height, face away, and take one or two steps forward.",
            "execution_notes": "Curl with both arms simultaneously.",
            "alternative_equipment": "Resistance bands",
            "tier_reasons": "Maximum stretch and tension on biceps, even tension throughout range.",
            "targeted_muscles": [
                "Biceps"
            ],
            "targeted_muscle_parts": "Long head, due to high stretch and tension.",
            "limitations": "None",
            "scientific_insights": "None",
            "additional_notes": "Recommended for biceps peak development.",
            "alternative_exercise": "Hammer Curl",
            "selection_reason": "Face Away Cable Curls provide maximum stretch and tension on the biceps, which is essential for muscle growth. This exercise is suitable for beginners as it offers even tension throughout the range of motion, helping to develop the biceps peak."
        },
        {
            "exercise_name": "Wide Grip Lat Pull Down",
            "setup_notes": "Sit down at a lat pull-down machine and adjust the knee pad to fit snugly against your thighs.",
            "execution_notes": "Grip the bar with a wide grip, pull the bar down to your upper chest while keeping your back straight, and then slowly return to the starting position.",
            "alternative_equipment": "Resistance bands",
            "tier_reasons": "Offers a big stretch on your lats, provides smooth even tension throughout the range of motion, feels great, and allows for easy overload by increasing the pin weight.",
            "targeted_muscles": [
                "Lats",
                "Mid Traps"
            ],
            "targeted_muscle_parts": "Targets both the lats and mid traps due to the wide grip and pulling motion.",
            "limitations": "None",
            "scientific_insights": "None",
            "additional_notes": "None",
            "alternative_exercise": "Neutral Grip Lat Pull Down",
            "selection_reason": "Wide Grip Lat Pull Down is an excellent choice for beginners aiming to develop their back muscles. It provides a big stretch and smooth tension, which is crucial for muscle growth. The exercise is easy to overload, making it suitable for progressive strength gains."
        },
        {
            "exercise_name": "Chest Supported Row",
            "setup_notes": "Use a chest-supported row machine or incline bench.",
            "execution_notes": "Pull the weight towards your chest while keeping your chest against the pad, and return to the starting position.",
            "alternative_equipment": "Resistance bands",
            "tier_reasons": "Stable, allows focus on back muscles, and can be done with various equipment.",
            "targeted_muscles": [
                "Lats",
                "Midback"
            ],
            "targeted_muscle_parts": "Targets both lats and midback due to the pulling motion.",
            "limitations": "None",
            "scientific_insights": "None",
            "additional_notes": "Crowned as the best exercise for back development.",
            "alternative_exercise": "Cable Row",
            "selection_reason": "Chest Supported Row is ideal for beginners as it provides stability, allowing the user to focus on back muscles without worrying about balance. It targets both the lats and midback, making it a comprehensive exercise for back development."
        }
    ],
    "warmup": {
        "total_warmup_duration": 6.0,
        "warmup_exercises": [
            {
                "exercise_name": "Arm Circles",
                "setup_notes": "Stand with feet shoulder-width apart.",
                "execution_notes": "Extend arms to the sides and make small circles, gradually increasing the size.",
                "sets_reps": "2 sets of 30 seconds each direction",
                "duration": "2.0"
            },
            {
                "exercise_name": "Dynamic Chest Opener",
                "setup_notes": "Stand with feet shoulder-width apart.",
                "execution_notes": "Swing arms forward and backward, opening up the chest.",
                "sets_reps": "2 sets of 15 swings",
                "duration": "1.5"
            },
            {
                "exercise_name": "Cat-Cow Stretch",
                "setup_notes": "Start on all fours with hands under shoulders and knees under hips.",
                "execution_notes": "Alternate between arching your back (cat) and dropping your belly (cow).",
                "sets_reps": "2 sets of 10 reps",
                "duration": "1.5"
            },
            {
                "exercise_name": "Bodyweight Squats",
                "setup_notes": "Stand with feet shoulder-width apart.",
                "execution_notes": "Perform squats, focusing on depth and control.",
                "sets_reps": "2 sets of 10 reps",
                "duration": "1.0"
            }
        ]
    }
}