{
    "workout_title": "Glute and Leg Sculpting Session",
    "total_workout_duration": 54.0,
    "num_exercises": 5,
    "warmup": {
        "warmup_duration": 6.0,
        "warmup_exercises": [
            {
                "exercise_name": "Dynamic Leg Swings",
                "setup_notes": "Stand next to a wall or support for balance.",
                "execution_notes": "Swing one leg forward and backward in a controlled manner. Perform 2 sets of 10 swings per leg."
            },
            {
                "exercise_name": "Bodyweight Squats",
                "setup_notes": "Stand with feet shoulder-width apart.",
                "execution_notes": "Perform squats with a controlled motion, focusing on depth and form. Perform 2 sets of 10 reps."
            },
            {
                "exercise_name": "Hip Circles",
                "setup_notes": "Stand with feet hip-width apart.",
                "execution_notes": "Perform circular motions with your hips, alternating directions. Perform 2 sets of 10 circles per direction."
            }
        ]
    },
    "sets": [
        {
            "set_number": 1,
            "set_strategy": "None",
            "set_duration": 12.0,
            "set_repetitions": 3,
            "target_muscle_group": [
                "Quadriceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Barbell Back Squat",
                    "target_muscle_part": {
                        "Quadriceps": [
                            "All heads"
                        ]
                    },
                    "setup": "Position the barbell on your upper traps. Stand with feet shoulder-width apart.",
                    "execution": [
                        "1. Grip the barbell with hands slightly wider than shoulder-width.",
                        "2. Unrack the bar and step back, setting your feet shoulder-width apart.",
                        "3. Keep your chest up and core engaged.",
                        "4. Squat down by bending your knees and hips, keeping your back straight.",
                        "5. Lower until your thighs are parallel to the ground.",
                        "6. Push through your heels to return to the starting position."
                    ],
                    "reps": "8-10",
                    "weight": "Select a weight where the last 2-3 reps feel challenging but still allow you to maintain proper form.",
                    "rest_time": "60-90 seconds",
                    "alternatives": "Smith Machine Squat: Offers similar quad engagement with reduced stabilizer involvement.",
                    "additional_tips": "Focus on maintaining a stable posture and proper bar path throughout the movement."
                }
            ]
        },
        {
            "set_number": 2,
            "set_strategy": "None",
            "set_duration": 10.0,
            "set_repetitions": 3,
            "target_muscle_group": [
                "Glutes"
            ],
            "exercises": [
                {
                    "exercise_name": "Barbell Hip Thrust",
                    "target_muscle_part": {
                        "Glutes": [
                            "Gluteus Maximus"
                        ]
                    },
                    "setup": "Sit on the ground with your upper back against a bench and a barbell over your hips.",
                    "execution": [
                        "1. Roll the barbell over your hips and position your feet flat on the ground, shoulder-width apart.",
                        "2. Drive through your heels to lift your hips until they are fully extended.",
                        "3. Keep a neutral pelvis and squeeze your glutes at the top.",
                        "4. Lower your hips back to the starting position in a controlled manner."
                    ],
                    "reps": "10-12",
                    "weight": "Select a weight where the last 2-3 reps feel challenging but still allow you to maintain proper form.",
                    "rest_time": "60 seconds",
                    "alternatives": "Single Leg Hip Thrusts: Offers unilateral benefits and targets the gluteus medius.",
                    "additional_tips": "Ensure your shins are vertical at the top of the movement for optimal glute activation."
                }
            ]
        },
        {
            "set_number": 3,
            "set_strategy": "None",
            "set_duration": 10.0,
            "set_repetitions": 3,
            "target_muscle_group": [
                "Hamstrings",
                "Glutes"
            ],
            "exercises": [
                {
                    "exercise_name": "Romanian Deadlift (RDL)",
                    "target_muscle_part": {
                        "Hamstrings": [
                            "All parts"
                        ],
                        "Glutes": [
                            "Gluteus Maximus"
                        ]
                    },
                    "setup": "Start with the bar on the ground. Pick it up like a regular deadlift for the first rep.",
                    "execution": [
                        "1. Stand with feet hip-width apart, holding the barbell with an overhand grip.",
                        "2. Keep your chest up and shoulders back.",
                        "3. Push your hips back while keeping your knees slightly bent.",
                        "4. Lower the barbell along your legs until you feel a stretch in your hamstrings.",
                        "5. Return to the starting position by driving your hips forward."
                    ],
                    "reps": "8-10",
                    "weight": "Select a weight where the last 2-3 reps feel challenging but still allow you to maintain proper form.",
                    "rest_time": "60-90 seconds",
                    "alternatives": "Sumo Deficit Deadlift: Offers a wider stance and emphasizes glute and hamstring engagement.",
                    "additional_tips": "Maintain a flat back throughout the movement to avoid lower back strain."
                }
            ]
        },
        {
            "set_number": 4,
            "set_strategy": "None",
            "set_duration": 8.0,
            "set_repetitions": 2,
            "target_muscle_group": [
                "Quadriceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Bulgarian Split Squat",
                    "target_muscle_part": {
                        "Quadriceps": [
                            "Vastus Medialis",
                            "Vastus Lateralis"
                        ]
                    },
                    "setup": "Position one foot on a bench behind you.",
                    "execution": [
                        "1. Stand a few feet in front of a bench and place one foot on it.",
                        "2. Keep your torso upright and core engaged.",
                        "3. Lower your body by bending your front knee until your thigh is parallel to the ground.",
                        "4. Push through your front heel to return to the starting position."
                    ],
                    "reps": "10-12",
                    "weight": "Select a weight where the last 2-3 reps feel challenging but still allow you to maintain proper form.",
                    "rest_time": "60 seconds",
                    "alternatives": "Smith Machine Front Foot Elevated Lunge: Offers similar quad and glute engagement with a focus on the front foot.",
                    "additional_tips": "Focus on balance and control throughout the movement to maximize quad engagement."
                }
            ]
        },
        {
            "set_number": 5,
            "set_strategy": "None",
            "set_duration": 8.0,
            "set_repetitions": 3,
            "target_muscle_group": [
                "Hamstrings"
            ],
            "exercises": [
                {
                    "exercise_name": "Glute Ham Raise",
                    "target_muscle_part": {
                        "Hamstrings": [
                            "All parts"
                        ]
                    },
                    "setup": "Use a GHR machine or set up on a lat pull-down machine with a counterbalance.",
                    "execution": [
                        "1. Position your feet securely under the foot pads.",
                        "2. Start in a kneeling position with your body straight.",
                        "3. Lower your body by bending at the knees, keeping your back straight.",
                        "4. Pull yourself back up using your hamstrings to return to the starting position."
                    ],
                    "reps": "8-10",
                    "weight": "Use bodyweight or light resistance to maintain control and proper form.",
                    "rest_time": "60 seconds",
                    "alternatives": "Nordic ham curls with a partner for assistance.",
                    "additional_tips": "Focus on controlling the negative portion of the movement for maximum hamstring activation."
                }
            ]
        }
    ]
}