{
    "workout_title": "30-Minute Biceps & Back Blast",
    "total_workout_duration": 15.0,
    "num_exercises": 4,
    "warmup": {
        "warmup_duration": 7.0,
        "warmup_exercises": [
            {
                "exercise_name": "Arm circles",
                "setup_notes": null,
                "execution_notes": "Perform forward and backward arm circles for 30 seconds each."
            },
            {
                "exercise_name": "Shoulder rotations",
                "setup_notes": null,
                "execution_notes": "Perform forward and backward shoulder rotations for 30 seconds each."
            },
            {
                "exercise_name": "Torso twists",
                "setup_notes": null,
                "execution_notes": "Perform torso twists to the left and right for 30 seconds each."
            },
            {
                "exercise_name": "Cat-cow stretch",
                "setup_notes": "Start on your hands and knees.",
                "execution_notes": "Alternate between arching and rounding your back."
            },
            {
                "exercise_name": "Wrist stretches",
                "setup_notes": null,
                "execution_notes": "Perform wrist extensions and flexions for 30 seconds each."
            },
            {
                "exercise_name": "Light cardio",
                "setup_notes": null,
                "execution_notes": "Perform light cardio, such as jogging in place or jumping jacks, for 1 minute."
            }
        ]
    },
    "sets": [
        {
            "set_number": 1,
            "set_strategy": "Superset",
            "set_duration": 7.5,
            "set_repetitions": 15,
            "target_muscle_group": [
                "Biceps",
                "Back"
            ],
            "exercises": [
                {
                    "exercise_name": "Preacher Curl",
                    "target_muscle_part": {
                        "Biceps": [
                            "Distal biceps"
                        ]
                    },
                    "setup": "Adjust the preacher bench so your upper arm is comfortably supported against the pad. Position yourself so your elbow is locked against the bench throughout the exercise.",
                    "execution": [
                        "1. Grip the bar with an underhand grip (palms facing upwards), slightly narrower than shoulder-width.",
                        "2. Keeping your upper arm stationary against the pad, curl the weight upwards towards your shoulders, focusing on squeezing your biceps at the top of the movement.",
                        "3. Slowly lower the weight back to the starting position, maintaining tension in your biceps throughout the movement."
                    ],
                    "media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2021/10/dumbbell-preacher-curl.gif",
                    "reps": 8,
                    "weight": "Choose a weight that allows you to complete 8 reps with good form. Increase the weight gradually as you get stronger.",
                    "alternative_equipments": "Resistance band",
                    "rest_time": "0 seconds",
                    "alternative_exercise": "Machine Preacher Curl",
                    "alternative_exercise_setup": "Adjust the seat and arm pads of the machine to fit your body comfortably. Ensure your upper arms are securely supported against the pads.",
                    "alternative_exercise_execution": [
                        "1. Grip the handles with an underhand grip (palms facing upwards).",
                        "2. Keeping your upper arms stationary against the pads, curl the weight upwards towards your shoulders, focusing on squeezing your biceps at the top of the movement.",
                        "3. Slowly lower the weight back to the starting position, maintaining tension in your biceps throughout the movement."
                    ],
                    "alternative_exercise_media_url": "https://i.pinimg.com/originals/b6/ea/17/b6ea17377640b9bb77068888388b5d0a.gif",
                    "alternative_exercise_reps": 8,
                    "alternative_exercise_weight": "Select a weight that allows you to perform 8 repetitions with good form. Gradually increase the weight as you gain strength.",
                    "additional_tips": "Focus on the mind-muscle connection and feel the biceps working throughout the movement. Avoid using momentum to lift the weight."
                },
                {
                    "exercise_name": "Chest Supported Row",
                    "target_muscle_part": {
                        "Back": [
                            "Lats",
                            "Midback"
                        ]
                    },
                    "setup": "Adjust the chest support pad of the machine to fit your chest comfortably. Position yourself so your chest is firmly pressed against the pad throughout the exercise.",
                    "execution": [
                        "1. Grip the handle with a pronated grip (palms facing downwards), slightly wider than shoulder-width.",
                        "2. Keeping your back straight and chest pressed against the pad, pull the handle towards your chest, squeezing your shoulder blades together at the top of the movement.",
                        "3. Slowly return to the starting position, maintaining tension in your back muscles throughout the movement."
                    ],
                    "media_url": "https://media.tenor.com/ft6FHrqty-8AAAAM/remada-pronada-maquina.gif",
                    "reps": 7,
                    "weight": "Select a weight that allows you to complete 7 reps with good form. Gradually increase the weight as you get stronger.",
                    "alternative_equipments": "Dumbbells",
                    "rest_time": "0 seconds",
                    "alternative_exercise": "Cable Row",
                    "alternative_exercise_setup": "Adjust the cable machine to a height that allows you to maintain a straight back during the exercise. Stand with your feet shoulder-width apart, facing the cable machine.",
                    "alternative_exercise_execution": [
                        "1. Grip the cable handle with a pronated grip (palms facing downwards).",
                        "2. Keeping your back straight, pull the handle towards your chest, squeezing your shoulder blades together at the top of the movement.",
                        "3. Slowly return to the starting position, maintaining tension in your back muscles throughout the movement."
                    ],
                    "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2023/09/cable-row.gif",
                    "alternative_exercise_reps": 7,
                    "alternative_exercise_weight": "Choose a weight that allows you to perform 7 repetitions with good form. Gradually increase the weight as you gain strength.",
                    "additional_tips": "Focus on squeezing your shoulder blades together at the top of the movement. Avoid using momentum to lift the weight."
                }
            ]
        },
        {
            "set_number": 2,
            "set_strategy": "Superset",
            "set_duration": 7.5,
            "set_repetitions": 15,
            "target_muscle_group": [
                "Biceps",
                "Back"
            ],
            "exercises": [
                {
                    "exercise_name": "Hammer Curl",
                    "target_muscle_part": {
                        "Biceps": [
                            "Biceps",
                            "Brachialis"
                        ]
                    },
                    "setup": "Stand with your feet shoulder-width apart, holding a dumbbell in each hand.",
                    "execution": [
                        "1. Grip the dumbbells with a neutral grip (palms facing each other).",
                        "2. Keeping your elbows close to your sides, curl the dumbbells upwards towards your shoulders, focusing on squeezing your biceps and brachialis at the top of the movement.",
                        "3. Slowly lower the dumbbells back to the starting position, maintaining tension in your biceps and brachialis throughout the movement."
                    ],
                    "media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2023/02/alternating-hammer-curls.gif",
                    "reps": 7,
                    "weight": "Choose a weight that allows you to complete 7 reps with good form. Increase the weight gradually as you get stronger.",
                    "alternative_equipments": "Resistance band",
                    "rest_time": "0 seconds",
                    "alternative_exercise": "Incline Curl",
                    "alternative_exercise_setup": "Adjust an incline bench to a comfortable angle. Sit on the bench with your feet flat on the floor, holding a dumbbell in each hand.",
                    "alternative_exercise_execution": [
                        "1. Grip the dumbbells with an underhand grip (palms facing upwards).",
                        "2. Keeping your elbows close to your sides, curl the dumbbells upwards towards your shoulders, focusing on squeezing your biceps at the top of the movement.",
                        "3. Slowly lower the dumbbells back to the starting position, maintaining tension in your biceps throughout the movement."
                    ],
                    "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/10/incline-dumbbell-curl.gif",
                    "alternative_exercise_reps": 7,
                    "alternative_exercise_weight": "Select a weight that allows you to perform 7 repetitions with good form. Gradually increase the weight as you gain strength.",
                    "additional_tips": "Focus on the mind-muscle connection and feel the biceps and brachialis working throughout the movement. Avoid using momentum to lift the weight."
                },
                {
                    "exercise_name": "Wide Grip Lat Pull Down",
                    "target_muscle_part": {
                        "Back": [
                            "Lats",
                            "Mid Traps"
                        ]
                    },
                    "setup": "Sit down at a lat pull-down machine and adjust the knee pad to fit snugly against your thighs. Grip the bar with a wide overhand grip (palms facing away from you).",
                    "execution": [
                        "1. Keeping your back straight and chest up, pull the bar down to your upper chest, focusing on squeezing your lats at the bottom of the movement.",
                        "2. Slowly return to the starting position, maintaining tension in your lats throughout the movement."
                    ],
                    "media_url": "https://ccuuubmtdurkmbeufybi.supabase.co/storage/v1/object/public/animations/0579.gif",
                    "reps": 8,
                    "weight": "Select a weight that allows you to complete 8 reps with good form. Gradually increase the weight as you get stronger.",
                    "alternative_equipments": "Resistance band",
                    "rest_time": "0 seconds",
                    "alternative_exercise": "Neutral Grip Lat Pull Down",
                    "alternative_exercise_setup": "Sit down at a lat pull-down machine and adjust the knee pad to fit snugly against your thighs. Grip the bar with a neutral grip (palms facing each other).",
                    "alternative_exercise_execution": [
                        "1. Keeping your back straight and chest up, pull the bar down to your upper chest, focusing on squeezing your lats at the bottom of the movement.",
                        "2. Slowly return to the starting position, maintaining tension in your lats throughout the movement."
                    ],
                    "alternative_exercise_media_url": "https://fitnessvolt.com/wp-content/uploads/2023/09/close-grip-lat-pulldown.gif",
                    "alternative_exercise_reps": 8,
                    "alternative_exercise_weight": "Choose a weight that allows you to perform 8 repetitions with good form. Gradually increase the weight as you gain strength.",
                    "additional_tips": "Focus on the mind-muscle connection and feel the lats working throughout the movement. Avoid using momentum to lift the weight."
                }
            ]
        }
    ]
}