{
    "workout_title": "Beginner's Triceps Builder",
    "total_workout_duration": 30.0,
    "num_exercises": 3,
    "warmup": {
        "warmup_duration": 6.0,
        "warmup_exercises": [
            {
                "exercise_name": "Arm Circles",
                "setup_notes": "Stand with feet shoulder-width apart, arms extended to the sides.",
                "execution_notes": "Make small circles with your arms, gradually increasing the size. Reverse the direction halfway through. Perform 2 sets of 30 seconds each direction."
            },
            {
                "exercise_name": "Dynamic Triceps Stretch",
                "setup_notes": "Stand tall, raise one arm overhead, and bend the elbow to touch the opposite shoulder blade.",
                "execution_notes": "Use the opposite hand to gently push the elbow back. Alternate arms in a dynamic motion. Perform 2 sets of 15 reps per arm."
            },
            {
                "exercise_name": "Shoulder Taps",
                "setup_notes": "Start in a high plank position with hands under shoulders.",
                "execution_notes": "Tap each shoulder with the opposite hand, keeping the core engaged and hips stable. Perform 2 sets of 20 taps."
            }
        ]
    },
    "sets": [
        {
            "set_number": 1,
            "set_strategy": "None",
            "set_duration": 8.0,
            "set_repetitions": 3,
            "target_muscle_group": [
                "Triceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Overhead Cable Triceps Extension",
                    "target_muscle_part": {
                        "Triceps": [
                            "Long head"
                        ]
                    },
                    "setup": "Position the cable at a low setting and use a bar attachment. Stand facing away from the cable machine with arms overhead.",
                    "execution": "1. Grip the bar with both hands and stand with feet shoulder-width apart. 2. Keep your elbows close to your head and extend your arms fully overhead. 3. Bend your elbows to lower the bar behind your head, feeling a stretch in your triceps. 4. Extend your arms back to the starting position, keeping tension in the triceps throughout.",
                    "reps": "10-12",
                    "weight": "Select a weight that allows for 10-12 reps with good form, typically around 50-60% of your 1RM.",
                    "alternative_equipments": "Resistance band",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Overhead Cable Extension with Rope",
                    "alternative_exercise_setup": "Attach a rope to a low pulley. Stand facing away from the machine, holding the rope with both hands overhead.",
                    "alternative_exercise_execution": "1. Grip the rope with both hands and stand with feet shoulder-width apart. 2. Keep your elbows close to your head and extend your arms fully overhead. 3. Bend your elbows to lower the rope behind your head, feeling a stretch in your triceps. 4. Extend your arms back to the starting position, keeping tension in the triceps throughout.",
                    "alternative_exercise_reps": "10-12",
                    "alternative_exercise_weight": "Use a resistance band that provides similar tension to the cable setup.",
                    "additional_tips": "Focus on keeping your elbows stationary to maximize the stretch and contraction of the triceps."
                }
            ]
        },
        {
            "set_number": 2,
            "set_strategy": "None",
            "set_duration": 8.0,
            "set_repetitions": 3,
            "target_muscle_group": [
                "Triceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Skull Crushers",
                    "target_muscle_part": {
                        "Triceps": [
                            "Long head"
                        ]
                    },
                    "setup": "Use an EZ bar or straight bar. Lie on a bench with the bar overhead.",
                    "execution": "1. Lie on a bench with your feet flat on the floor. 2. Hold the bar with an overhand grip, arms extended above your chest. 3. Bend your elbows to lower the bar towards your forehead, keeping your upper arms stationary. 4. Extend your arms to return to the starting position, focusing on the triceps contraction.",
                    "reps": "10-12",
                    "weight": "Choose a weight that allows for 10-12 reps, focusing on form and control, typically around 50-60% of your 1RM.",
                    "alternative_equipments": "Dumbbells",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Dumbbell French Press",
                    "alternative_exercise_setup": "Sit on a bench with a dumbbell in each hand, arms extended overhead.",
                    "alternative_exercise_execution": "1. Sit on a bench with your feet flat on the floor. 2. Hold a dumbbell in each hand, arms extended above your head. 3. Bend your elbows to lower the dumbbells behind your head, keeping your upper arms stationary. 4. Extend your arms to return to the starting position, focusing on the triceps contraction.",
                    "alternative_exercise_reps": "10-12",
                    "alternative_exercise_weight": "Select dumbbells that allow for controlled movement and full range of motion.",
                    "additional_tips": "Keep your elbows in to prevent shoulder strain and ensure the focus remains on the triceps."
                }
            ]
        },
        {
            "set_number": 3,
            "set_strategy": "None",
            "set_duration": 8.0,
            "set_repetitions": 3,
            "target_muscle_group": [
                "Triceps"
            ],
            "exercises": [
                {
                    "exercise_name": "Bar Press Down",
                    "target_muscle_part": {
                        "Triceps": [
                            "Medial head",
                            "Lateral head"
                        ]
                    },
                    "setup": "Attach a straight bar to a high pulley.",
                    "execution": "1. Stand facing the machine, feet shoulder-width apart. 2. Grip the bar with an overhand grip, elbows close to your body. 3. Press the bar down by extending your elbows, keeping your upper arms stationary. 4. Return to the starting position with control, maintaining tension in the triceps.",
                    "reps": "10-12",
                    "weight": "Select a weight that allows for 10-12 reps with good form, typically around 50-60% of your 1RM.",
                    "alternative_equipments": "Resistance band",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Rope Press Down",
                    "alternative_exercise_setup": "Attach a rope to a high pulley.",
                    "alternative_exercise_execution": "1. Stand facing the machine, feet shoulder-width apart. 2. Grip the rope with both hands, elbows close to your body. 3. Press the rope down by extending your elbows, keeping your upper arms stationary. 4. Return to the starting position with control, maintaining tension in the triceps.",
                    "alternative_exercise_reps": "10-12",
                    "alternative_exercise_weight": "Use a resistance band that provides similar tension to the cable setup.",
                    "additional_tips": "Focus on keeping your elbows close to your body to maximize triceps engagement."
                }
            ]
        }
    ]
}