{
    "exercises": [
        {
            "exercise_name": "Machine Chest Press",
            "setup": "none",
            "execution": "Ensure a deep stretch on the pecs with high tension throughout the range of motion. Maintain a stable position to enhance mind-muscle connection.",
            "media_url": "",
            "alternative_equipment": "Barbell",
            "tier_reasons": "Provides a deep stretch with high tension, smooth resistance profile, easy to overload, safer to push to failure.",
            "targeted_muscles": [
                "Pectorals"
            ],
            "targeted_muscle_parts": "none",
            "limitations": "none",
            "scientific_insights": "none",
            "additional_notes": "Find a machine that feels good at your gym for optimal results.",
            "alternative_exercise": "Bench Press",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/04/barbell-bench-press.gif",
            "selection_reason": "This S-Tier compound exercise is ideal for a beginner due to its inherent stability and ease of learning proper form, which aligns with the 'beginners' fitness level guidelines. It provides a 'deep stretch with high tension' and a 'smooth resistance profile,' directly addressing the user's criteria for effective pec development and a 'feels good' experience. Its 'easy to overload' nature also supports the 'simple progression' requirement, allowing the user to safely and consistently build strength and muscle. As a compound movement, it efficiently targets the overall pectorals, maximizing skill development as per the beginner's wiki."
        },
        {
            "exercise_name": "Incline Dumbbell Press",
            "setup": "none",
            "execution": "Perform similar to flat dumbbell press but with an incline.",
            "media_url": "https://fitnessprogramer.com/wp-content/uploads/2021/02/Incline-Dumbbell-Press.gif",
            "alternative_equipment": "Smith Machine",
            "tier_reasons": "Same benefits as flat dumbbell press with added upper pec emphasis.",
            "targeted_muscles": [
                "Pectorals"
            ],
            "targeted_muscle_parts": "Upper pecs",
            "limitations": "none",
            "scientific_insights": "none",
            "additional_notes": "none",
            "alternative_exercise": "Incline Bench Press",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/01/dumbbell-incline-reverse-grip-bench.gif",
            "selection_reason": "This A-Tier compound exercise is selected to complement the Machine Chest Press by specifically targeting the 'Upper Pectorals,' contributing to balanced chest development as suggested by research insights. Dumbbells allow for a 'deeper stretch' than barbells, aligning with the user's preference for exercises that provide a big stretch with high tension. While requiring slightly more stabilization than a machine, it's appropriate for a beginner with 3-12 months of experience, offering a natural progression and promoting better mind-muscle connection. It also allows for 'simple progression' by increasing dumbbell weight."
        },
        {
            "exercise_name": "Seated Cable Pec Fly",
            "setup": "Sit down to increase stability and ensure all tension is applied directly to the pecs.",
            "execution": "Perform fly movement with cables, ensuring a big stretch on the pecs with high tension.",
            "media_url": "https://www.youtube.com/embed/fGm-ef-4PVk?start=649&end=661",
            "alternative_equipment": "Dumbbells",
            "tier_reasons": "Provides a big stretch with high tension, stable, smooth tension throughout the range of motion.",
            "targeted_muscles": [
                "Pectorals"
            ],
            "targeted_muscle_parts": "none",
            "limitations": "none",
            "scientific_insights": "none",
            "additional_notes": "This is currently the favorite chest isolation movement.",
            "alternative_exercise": "Pec Deck Machine",
            "alternative_exercise_media_url": "https://www.inspireusafoundation.org/wp-content/uploads/2022/07/pec-deck.gif",
            "selection_reason": "As an S-Tier isolation exercise, the Seated Cable Pec Fly is an excellent choice for beginners to focus on the pectorals without significant involvement of other muscle groups. Its 'seated' position provides enhanced 'stability,' making it easier for a beginner to maintain proper form and establish a strong 'mind-muscle connection.' The cables offer 'smooth tension throughout the range of motion' and a 'big stretch with high tension,' perfectly aligning with the user's core criteria for effective pec development and a 'feels good' experience. This exercise allows for 'simple progression' by easily adjusting the cable weight."
        }
    ],
    "warmup": {
        "total_warmup_duration": 5.0,
        "warmup_exercises": [
            {
                "exercise_name": "Arm Circles",
                "setup": "Stand tall with feet shoulder-width apart, arms extended straight out to the sides at shoulder height.",
                "execution": "Perform small circles forward for 30 seconds, then reverse and perform small circles backward for 30 seconds. Gradually increase the size of the circles.",
                "sets_reps": "1 set, 30 seconds forward, 30 seconds backward",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Thoracic Rotations (Seated or Standing)",
                "setup": "Sit or stand with a straight back. Place hands behind your head or cross them over your chest.",
                "execution": "Gently rotate your upper body to one side, feeling a stretch in your mid-back and chest. Hold briefly, then rotate to the other side. Focus on moving from your thoracic spine, not just your neck or lower back.",
                "sets_reps": "1 set, 10-12 rotations per side",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Cat-Cow Stretch",
                "setup": "Start on all fours with hands directly under shoulders and knees under hips. Keep your back flat.",
                "execution": "Inhale as you drop your belly towards the floor, lift your chest and tailbone (Cow pose). Exhale as you round your spine towards the ceiling, tucking your chin to your chest (Cat pose). Move fluidly between the two positions.",
                "sets_reps": "1 set, 8-10 repetitions",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Dynamic Chest Stretch (Arm Swings)",
                "setup": "Stand with feet shoulder-width apart, arms extended straight out to the sides.",
                "execution": "Swing your arms forward and across your body, alternating which arm crosses on top. Then, swing them back out to the sides, opening up your chest. Maintain a controlled, rhythmic motion.",
                "sets_reps": "1 set, 10-12 repetitions",
                "duration": "1 minute"
            },
            {
                "exercise_name": "Light Knee Push-ups",
                "setup": "Start in a push-up position, but with your knees on the ground. Hands slightly wider than shoulder-width apart, fingers pointing forward. Keep your body in a straight line from head to knees.",
                "execution": "Lower your chest towards the floor by bending your elbows, keeping them tucked slightly. Push back up to the starting position, engaging your chest muscles. Focus on controlled movement and feeling the chest activation.",
                "sets_reps": "1 set, 10-15 repetitions",
                "duration": "1 minute"
            }
        ]
    }
}