{
    "sets": [
        {
            "set_number": 1,
            "set_time": 8,
            "set_strategy": "None",
            "set_repetitions": 3,
            "target_muscle_group": [
                "Back"
            ],
            "set_reasoning": "For a beginner aiming to increase back width, focusing on the lats is crucial. This set includes 3 sets of Wide Grip Lat Pull Down, which is effective for targeting the lats and mid traps. The volume is appropriate for a beginner, allowing for skill development and muscle engagement without overtraining.",
            "exercises": [
                {
                    "exercise_name": "Wide Grip Lat Pull Down",
                    "target_muscle_part": {
                        "Back": [
                            "Lats",
                            "Mid Traps"
                        ]
                    },
                    "reps": "10-12",
                    "weight": "Start with a weight that allows you to complete 10-12 reps with good form. Adjust as needed.",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Wide Grip Pull-Up",
                    "alternative_exercise_reps": "6-8",
                    "alternative_exercise_weight": "Use body weight or add assistance if needed to complete 6-8 reps."
                }
            ]
        },
        {
            "set_number": 2,
            "set_time": 8,
            "set_strategy": "None",
            "set_repetitions": 3,
            "target_muscle_group": [
                "Back"
            ],
            "set_reasoning": "The Neutral Grip Lat Pull Down emphasizes the lats, providing a different angle of pull to ensure comprehensive lat engagement. This set complements the previous exercise by varying the grip, which can help in maximizing lat activation and growth.",
            "exercises": [
                {
                    "exercise_name": "Neutral Grip Lat Pull Down",
                    "target_muscle_part": {
                        "Back": [
                            "Lats"
                        ]
                    },
                    "reps": "10-12",
                    "weight": "Choose a weight that allows for 10-12 reps with proper form. Adjust as needed.",
                    "rest_time": "60 seconds",
                    "alternative_exercise": "Neutral Grip Pull-Up",
                    "alternative_exercise_reps": "6-8",
                    "alternative_exercise_weight": "Use body weight or add assistance if needed to complete 6-8 reps."
                }
            ]
        },
        {
            "set_number": 3,
            "set_time": 8,
            "set_strategy": "None",
            "set_repetitions": 3,
            "target_muscle_group": [
                "Back"
            ],
            "set_reasoning": "The Half Kneeling One Arm Lat Pull Down targets the lats unilaterally, which is beneficial for correcting muscle imbalances and ensuring even development. This exercise also allows for a high stretch and tension, promoting muscle growth.",
            "exercises": [
                {
                    "exercise_name": "Half Kneeling One Arm Lat Pull Down",
                    "target_muscle_part": {
                        "Back": [
                            "Lats"
                        ]
                    },
                    "reps": "10-12 per arm",
                    "weight": "Select a weight that allows for 10-12 reps per arm with good form. Adjust as needed.",
                    "rest_time": "60 seconds between arms",
                    "alternative_exercise": "Croc Row",
                    "alternative_exercise_reps": "10-12 per arm",
                    "alternative_exercise_weight": "Choose a dumbbell weight that allows for 10-12 reps per arm with proper form."
                }
            ]
        }
    ],
    "workout_explanation": "This workout plan is designed to meet the user's goal of increasing back width by focusing on exercises that target the lats, a key muscle for achieving this goal. The exercises are selected to provide a variety of angles and grips, ensuring comprehensive engagement of the back muscles. The volume and intensity are appropriate for a beginner, allowing for skill development and muscle growth without overtraining. The total workout time is 24 minutes, which fits within the user's 30-minute time constraint, allowing for efficient use of time while achieving the desired training effect."
}